[
  {
    "recipeName": "The Ultimate Peanut Butter Banana Smoothie",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "5 mins",
    "cookTime": null,
    "nutrition": "426 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 cup frozen ripe banana slices ((1 medium banana yields ~1 cup slices))",
      "1/3 cup rolled oats ((gluten-free certified as needed))",
      "3/4 - 1 cup unsweetened almond milk",
      "2-3 Tbsp peanut butter",
      "1 handful baby spinach",
      "1 Tbsp flaxseed meal or hemp seeds ((for added nutrition))",
      "1-2 tsp honey or maple syrup ((or a pitted medjool date))",
      "1/4 tsp ground cinnamon"
    ],
    "recipeInstructions": [
      "1. Place all ingredients in a blender and blend until smooth and creamy, adding more almond milk to thin, banana or oats to thicken, or peanut butter for richness and peanut flavor.",
      "2. Serve immediately or freeze in an ice cube tray then reblend (adding dairy-free milk as needed) to enjoy later. Texture/flavor is best when fresh."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2022/01/4-Ingredient-Smoothie-SQUARE.jpg",
    "description": "A versatile peanut butter banana smoothie made with oats.",
    "serve": 1,
    "review": []
  },
  {
    "recipeName": "Easy Apple Coffee Cake (GF, Vegan)",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "20 mins",
    "cookTime": "40 mins",
    "nutrition": "323 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "3/4 cup unsweetened dairy-free milk ((we used almond))",
      "1/2 cup vegan butter, melted ((we like Miyoko's here))",
      "1/4 cup maple syrup",
      "1 tsp vanilla extract",
      "1/2 cup coconut sugar ((or sub organic cane sugar))",
      "2 1/2 cups almond flour",
      "1 1/2 cups DIY Gluten-Free Flour Blend ((see notes for store-bought))",
      "1 1/2 tsp baking powder",
      "1 1/2 tsp baking soda",
      "1/2 tsp cinnamon",
      "1/4 tsp sea salt",
      "1 1/2 cups chopped Granny Smith apples, peeled and cut into 1/2-inch cubes",
      "1/4 cup organic cane sugar",
      "1/4 cup coconut sugar ((or sub brown sugar))",
      "1/2 tsp cinnamon",
      "1/4 cup vegan butter, melted ((we like Miyok's here))",
      "1/2 - 3/4 cup DIY Gluten-Free Flour Blend ((see notes for store-bought))"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 375 F (190 C) and line an 8x8-inch baking dish with parchment paper, leaving plenty of paper over the edges so you can easily lift the cake out later. This recipe will also work in a 9-inch round cake pan, or two 6-inch round cake pans.",
      "2. In a large mixing bowl, combine dairy-free milk, melted butter, maple syrup, and vanilla and mix well. Next, add the coconut sugar, almond flour, gluten-free flour blend, baking powder, baking soda, cinnamon, and salt and stir until well combined. The texture will be quite thick and will resemble a cookie dough more than a typical cake batter. Add the cubed apples and mix until they are evenly distributed throughout the batter.",
      "3. Scrape the batter into the prepared baking dish and spread it evenly. It's okay if the top has some texture; it will be covered with the crumble topping later!",
      "4. Put the cake into the oven and bake for 40 minutes. Meanwhile, prepare the crumble topping (optional).",
      "5. To your now-empty mixing bowl, add the cane sugar, coconut sugar, and cinnamon and mix with a fork until evenly combined. Add the vegan butter and mix well. Next, begin adding the flour in 1/4 cup (40 g) increments, mixing well with your fork after each addition. You may need more or less flour depending on the brand of your gluten-free blend. Add flour until the texture appears pale and slightly dry and the mixture clumps together easily when you pinch it.",
      "6. At the 40-minute mark, remove the cake from the oven and carefully add the crumble topping in an even layer on top of the cake. Return the cake to the oven for 5 minutes until the crumble topping is dry to the touch and just beginning to look toasty.",
      "7. Remove from the oven and let cool for at least 10 minutes before removing from the baking dish. Let cool almost completely before slicing and serving. Keep at room temperature for up to 3 days or in the freezer for up to 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/08/Apple-Crumb-Cake-SQUARE.jpg",
    "description": "Perfectly balanced, slightly toasty, classic apple coffee cake.",
    "serve": 12,
    "review": []
  },
  {
    "recipeName": "Vegan Chorizo Breakfast Tacos",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "5 mins",
    "cookTime": "25 mins",
    "nutrition": "208 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 lb yellow or red potatoes, chopped into even ~1/4 – 3/8-inch pieces",
      "1 Tbsp avocado oil ((or olive oil))",
      "1/2 tsp sea salt",
      "1 batch Easy Vegan Chorizo",
      "Salsa of choice",
      "10 corn tortillas",
      "1 large avocado, chopped"
    ],
    "recipeInstructions": [
      "1. POTATOES: Preheat oven to 425 F (218 C) and line a large baking sheet with parchment paper. Add chopped potatoes (~1/4 – 3/8-inch thick) to the baking sheet and drizzle with avocado oil. Then add salt and toss well to combine. Roast until golden brown and crispy, or about 20-25 minutes. You'll know they're done when they're golden brown on the bottom and edges and tender in the center.",
      "2. CHORIZO: Prepare Easy Vegan Chorizo mixture while the potatoes are cooking. You can also use store-bought such as Soyrizo or leftover Vegan Chorizo Links (if using links, break them up into a crumble texture before cooking). To cook the chorizo (any of the options), heat a 10-inch nonstick or well-seasoned cast iron skillet over medium heat. Add 1 Tbsp (15 ml) avocado oil and place half of the chorizo into the skillet. Distribute evenly over the pan so it's in one thin layer. Cook for 3-4 minutes, undisturbed. It should be sizzling and popping slightly - if it's not, turn up the heat a bit. Repeat with the remaining chorizo.",
      "3. SALSA: Optionally, prepare Mango Salsa. Otherwise, use any store-bought salsa you enjoy. Other delicious homemade options include our Easy Red Salsa, Chipotle Red Salsa, or Roasted Salsa Verde.",
      "4. TORTILLAS: Warm tortillas by wrapping in a damp paper towel (or kitchen towel) and microwaving for 30 seconds – 1 minute. If using fresh or homemade tortillas, you can warm them one at a time in a cast iron skillet over high heat (or on a hot grill) for 10-20 seconds on each side (or until just warmed), then wrap in a towel to keep warm until serving.",
      "5. TACOS: To the warmed tortillas, add chorizo, potatoes, salsa, and chopped avocado and enjoy!",
      "6. Best when fresh. Leftovers will keep stored separately in the refrigerator for 2-3 days. Reheat potatoes and vegan chorizo in a skillet over medium heat, adding more oil as needed to prevent sticking. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/08/Vegan-Chorizo-Breakfast-Tacos-SQUARE.jpg",
    "description": "Incredibly delicious breakfast tacos with vegan chorizo, salsa, and avocado.",
    "serve": 10,
    "review": []
  },
  {
    "recipeName": "Vegan Chorizo Sausage Links (10 Ingredients!)",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "40 mins",
    "cookTime": "40 mins",
    "nutrition": "98 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "3 Tbsp flaxseed meal ((ground flax seeds))",
      "1/2 cup water",
      "1 (15-oz.) can red kidney beans",
      "1 1/2 cups rolled oats ((certified gluten-free as needed))",
      "1 cup cremini mushrooms, roughly chopped",
      "5 tsp chili powder blend ((NOT chili flakes or cayenne pepper))",
      "5 tsp smoked paprika",
      "1/2 - 1 tsp cayenne  ((optional))",
      "3 Tbsp ketchup",
      "4 cloves garlic, minced ((optional))",
      "1 tsp each sea salt &amp; black pepper",
      "1/2 cup walnuts, finely chopped",
      "2 Tbsp avocado oil ((for cooking))"
    ],
    "recipeInstructions": [
      "1. Prepare flax eggs by adding flaxseed meal and water to a small bowl and stirring to combine. Let rest for 5 minutes to thicken.",
      "2. Drain and rinse the kidney beans, and pat dry with a kitchen towel or paper towel.",
      "3. In a food processor or blender, pulse the oats until they form a coarse flour - there should not be any whole oats visible.",
      "4. Add the beans and mushrooms to the oats and pulse a few times to break the beans and mushrooms into smaller pieces. Then add the flax eggs, chili powder, smoked paprika, cayenne (optional, start with the lesser amount), ketchup, garlic (optional), and salt and pepper. Pulse to fully combine, but avoid processing it into too smooth of a paste - leave some chunks for texture. Taste and season with more salt and pepper as needed, more paprika for smokiness, or cayenne for heat. Transfer to a bowl and stir in the chopped walnuts until fully combined.",
      "5. Scoop 2 tablespoons of the mixture and form into a mini sausage link shape. If it is too sticky, run your hands under some water and try again with slightly wet hands. Using 2 tablespoons will make ~16 sausages, or you can also use a 1/3-cup measurement to make 8 sausages about 6 inches long (amounts as recipe is written // adjust if altering number of servings).",
      "6. Once formed, place sausages on a plate lined with parchment paper and chill in the refrigerator for 20-25 minutes, until firm and not sticky to the touch.",
      "7. While your sausages chill, bring a few inches of water to a boil in a large pot with a steamer insert. Remove your sausages from the refrigerator and wrap each sausage in a small piece of parchment paper, twisting the ends to seal. Place sausages in the steamer basket and steam for 30 minutes, until firm and cooked through. Add more water at the 15-minute mark (or as needed) to avoid scorching your pot.",
      "8. If freezing for later, cool completely and transfer to the freezer. Otherwise, to cook and brown the sausages, heat a large cast iron skillet over medium heat and add 1 Tbsp (15 ml) oil to the pan. Remove the sausages from the parchment paper, add as many as will fit in the pan comfortably, and fry for 5-10 minutes, turning every once in a while until all sides are slightly browned. Repeat with more oil and sausages. You can also cook the sausages on a grill if desired!",
      "9. Enjoy these on their own or with your favorite breakfast or brunch items. They'd be especially delicious with our Southwest Tofu Scramble, Perfect Roasted Potatoes, Corn Tortillas, and Mango Habanero Hot Sauce.",
      "10. Store leftovers in a sealed container in the refrigerator for up to 5 days or in the freezer for up to 1 month. They can be cooked on the stovetop directly from frozen."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/08/Vegan-Chorizo-Sausage-Links-SQUARE.jpg",
    "description": "Spicy, savory, and oh-so-satisfying vegan chorizo sausage links.",
    "serve": 16,
    "review": []
  },
  {
    "recipeName": "Pumpkin Pie Overnight Oats",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "375 mins",
    "cookTime": "5 mins",
    "nutrition": "449 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1/2 cup unsweetened plain almond milk ((or sub other neutral dairy-free milk))",
      "1/2 cup pumpkin purée ((unsweetened))",
      "1 Tbsp creamy unsalted almond butter  ((or cashew butter))",
      "1 Tbsp chia seeds",
      "1 1/2 Tbsp maple syrup",
      "3/4 - 1 1/4 tsp pumpkin pie spice",
      "1 tsp vanilla extract",
      "1/2 cup rolled oats ((certified gluten-free as needed))",
      "1/2 cup raw pecans, roughly chopped",
      "1 Tbsp maple syrup",
      "1 tsp pumpkin pie spice",
      "1/4 cup plain or vanilla coconut yogurt ((optional // we prefer Culina))"
    ],
    "recipeInstructions": [
      "1. OATS: To a small bowl add almond milk, pumpkin purée, almond butter, chia seeds, maple syrup, pumpkin pie spice, and vanilla and stir with a spoon to combine. Add oats and stir a few more times.",
      "2. Get two small mason jars or small bowls with lids, and divide the oats equally between them. Then press the oats down with a spoon to ensure all oats have been moistened and are immersed in liquid. Cover securely with lids or seal and set in the refrigerator overnight (or for at least 6 hours) to set/soak.",
      "3. CANDIED PECANS: Add roughly chopped pecans to a nonstick skillet over medium-low heat and toast them, stirring occasionally, for about 3 minutes. You should be able to smell the pecans slightly when they've gotten toasty! Turn the heat down to low, add the maple syrup, and mix quickly to evenly coat the pecans. Spread them out so they are not in any large clumps, then add the pumpkin pie spice and mix once more. Remove from heat and let cool completely. Store in an airtight container.",
      "4. The next day, open your oats and top with the candied pecans and coconut yogurt. Enjoy!",
      "5. Overnight oats will keep in the refrigerator for 2-3 days, though best within the first 12-24 hours in our experience. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/07/Pumpkin-Pie-Overnight-Oats-SQUARE.jpg",
    "description": "The creamy, delicious flavors of pumpkin pie infused into wholesome overnight oats.",
    "serve": 2,
    "review": []
  },
  {
    "recipeName": "The BEST Gluten-Free Bread (No-Knead!)",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "90 mins",
    "cookTime": "75 mins",
    "nutrition": "167 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "Avocado oil ((or other neutral oil // for greasing pan))",
      "2 cups warm water",
      "2 Tbsp organic cane sugar",
      "1 packet active dry yeast  ((we used Red Star // 1 packet yields ~2 1/4 tsp or 7 g))",
      "1/4 cup ground chia seeds",
      "1 cup brown rice flour ((plus more for flouring pan))",
      "3/4 cup oat flour ((certified gluten-free as needed // if oat-free, you can try subbing additional sorghum flour))",
      "1 cup potato starch",
      "3/4 cup sorghum flour",
      "2 tsp sea salt"
    ],
    "recipeInstructions": [
      "1. Prepare an 8 x 4-inch (or similar size) loaf pan by greasing it with oil and flouring with brown rice flour.",
      "2. In a medium mixing bowl, whisk together the warm water (100-110 degrees F / 38-43 C) and sugar until the sugar is dissolved. Whisk in the packet of yeast and let it bloom on the counter for 10 minutes until frothy. If it doesn't foam, start over - your water may have been too hot or the packet of yeast was expired.",
      "3. Once the yeast has bloomed, whisk in ground chia seeds and let the mixture gel for about 10 minutes.",
      "4. Meanwhile, in a large bowl, whisk together brown rice flour, oat flour, potato starch, sorghum flour, and salt.",
      "5. Add the wet ingredients to the center of the dry and stir together with a wooden spoon. The mixture will be slightly wet, like a thick sticky batter. Make sure to thoroughly mix in and break up any clumps of chia seeds (a whisk can be helpful).",
      "6. Put the batter into your prepared loaf pan and cover it with a clean kitchen towel. Place it in a warm, draft-free area to proof for an hour.",
      "7. Once batter has doubled in size, preheat the oven to 425 F (218 C). Once preheated, bake at 425 F (218 C) for 45 minutes, then turn the oven down to 375 F (190 C) for 30 minutes. Remove the bread from the oven and let it cool in the pan for 10 minutes. Then transfer to a cooling rack to cool completely before cutting into it.",
      "8. Store leftovers in a sealed container at room temperature for up to 3-4 days or in the refrigerator for up to 2 weeks. Bread can also be sliced and frozen for up to 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Gluten-Free-Sandwich-Bread-SQUARE.jpg",
    "description": "The ultimate gluten-free bread that's light, fluffy, flavorful, and endlessly versatile.",
    "serve": 12,
    "review": []
  },
  {
    "recipeName": "Apple Pie Overnight Oats",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "375 mins",
    "cookTime": "15 mins",
    "nutrition": "247 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "3/4 cup crisp, sweet apple, cut into small bite-size pieces ((peeling is optional for less texture // we prefer Honeycrisp))",
      "3/4 tsp ground cinnamon",
      "1 Tbsp maple syrup",
      "1 pinch sea salt",
      "3/4 cup unsweetened plain almond milk  ((or sub other dairy-free milk of choice))",
      "1 Tbsp chia seeds",
      "1/2 - 1 Tbsp maple syrup",
      "1/2 tsp ground cinnamon",
      "2 Tbsp creamy unsalted cashew or almond butter",
      "1 tsp vanilla extract",
      "1/2 cup rolled oats ((certified gluten-free as needed))"
    ],
    "recipeInstructions": [
      "1. APPLES: To a small saucepan, add chopped apples, cinnamon, maple syrup, and salt and mix to evenly distribute the cinnamon.",
      "2. Turn heat on low and cover. Cook, stirring occasionally, for about 10 minutes or until the apples are soft and tender. Remove the lid, turn the heat up to medium, and cook for 2-3 more minutes, stirring constantly, to evaporate some of the juices and create a nice syrup around the apples. Once most of the liquid is gone, turn off the heat and set aside.",
      "3. OATS: In a small bowl or liquid measuring cup, mix the almond milk, chia seeds, maple syrup, cinnamon, nut butter, and vanilla. Add the oats and stir until well-combined.",
      "4. Get two small mason jars or small bowls with lids. Place about a quarter of the cooked apple mixture into the bottom of each container, add half the oat mixture to each as your middle layer, then divide and place the rest of the cooked apples on top of the oats. Place in the refrigerator overnight, or for at least 6 hours.",
      "5. Enjoy chilled or at room temperature. Overnight oats will keep in the refrigerator for 2-3 days, though best within the first 12-24 hours in our experience. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Apple-Pie-Overnight-Oats-SQUARE.jpg",
    "description": "Naturally sweetened, cinnamon-infused, and just 9 wholesome ingredients required.",
    "serve": 2,
    "review": []
  },
  {
    "recipeName": "Gluten-Free Pancake Mix (Vegan)",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "10 mins",
    "cookTime": null,
    "nutrition": "175 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 1/2 cups brown rice flour",
      "1 1/2 cups almond flour",
      "1 1/2 cups oat flour* ((ground from rolled oats // certified gluten-free as needed))",
      "3/4 cup potato starch",
      "2 1/2 Tbsp baking powder",
      "3 Tbsp flaxseed meal ((ground flax seeds))",
      "1/3 heaping cup coconut sugar ((or sub organic cane sugar))",
      "1 tsp sea salt",
      "1 - 1 1/4 cup dairy-free milk ((almond, cashew, or boxed coconut))",
      "1 tsp apple cider vinegar or lemon juice",
      "1 tsp vanilla extract",
      "1 Tbsp melted vegan butter ((or coconut oil))",
      "2 cups dry pancake mix ((from above))",
      "Vegan butter",
      "Maple syrup",
      "Berry compote",
      "Peanut butter"
    ],
    "recipeInstructions": [
      "1. PANCAKE MIX: To a large mixing bowl, add all dry ingredients (brown rice flour, almond flour, oat flour, potato starch, baking powder, flaxseed meal, coconut sugar, salt). Whisk until well incorporated.",
      "2. Store pancake mix in an airtight container. It will keep at room temperature in a cool, dry place for at least 1 month or in the refrigerator or freezer up to 3 months.",
      "3. PANCAKES: To make 8 pancakes, combine 1 cup (240 ml) of dairy-free milk, 1 tsp apple cider vinegar or lemon juice, 1 tsp vanilla, and 1 Tbsp melted vegan butter (or coconut oil) in a medium mixing bowl. Set aside for 3-5 minutes to curdle slightly.",
      "4. Next add 2 cups (320 g) of dry pancake mix and stir to combine. Batter should be thick but pourable before resting. If too thick, stir in 1 Tbsp (15 ml) dairy-free milk at a time (we usually add 1-2 Tbsp (15-30 ml) more). Let the batter rest for 10 minutes (it will thicken).",
      "5. Meanwhile, heat a griddle, non-stick pan, or cast iron skillet over medium heat. Grease the pan lightly with vegan butter (or coconut oil). Once batter has rested and the pan is hot, add 1/4-cup of batter into the pan. Let the pancakes cook on the first side until the outer edges are dry and the center starts to hold bubbles - about 2-3 minutes. If they don't bubble, that's okay. Just check the undersides after 2-3 minutes to see if they are golden brown. Flip the pancakes and cook for 2-3 more minutes on the other side.",
      "6. Serve warm with extra vegan butter, maple syrup, berry compote, or peanut butter (we like a combination of all four).",
      "7. Store leftover (cooled) pancakes in an airtight container in the refrigerator for up to 2-3 days, or in the freezer for several weeks. Reheat in the toaster oven, microwave, or oven until hot."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Gluten-Free-Pancake-Mix-SQUARE.jpg",
    "description": "The ultimate gluten-free pancake mix that yields fluffy, naturally sweetened pancakes every time.",
    "serve": 20,
    "review": []
  },
  {
    "recipeName": "Whole Grain Vegan Pancake Mix (6 Ingredients!)",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "10 mins",
    "cookTime": null,
    "nutrition": "134 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "1 cup spelt flour",
      "1 cup whole wheat flour",
      "1/2 cup rolled oats",
      "1/4 cup coconut sugar ((or sub organic cane sugar))",
      "2 Tbsp baking powder",
      "1 tsp sea salt",
      "3/4 cup almond milk ((or other dairy-free milk))",
      "1 tsp vanilla extract",
      "2 Tbsp oil or melted vegan butter ((plus more for greasing pan))",
      "1 cup pancake mix ((from above))",
      "Vegan butter",
      "Maple syrup",
      "Berry compote",
      "Peanut butter"
    ],
    "recipeInstructions": [
      "1. PANCAKE MIX: In a large mixing bowl, combine spelt flour, whole wheat flour, oats, coconut sugar, baking powder, and salt. Whisk to combine until very well incorporated. Store pancake mix in an airtight container in the pantry for up to 1 month or in the refrigerator or freezer for up to 3 months.",
      "2. PANCAKES: To make 5 pancakes, combine 3/4 cup (180 ml) almond milk, 1 tsp vanilla extract, and 2 Tbsp (30 ml) oil or melted vegan butter in a medium mixing bowl.",
      "3. Add 1 cup (130 g) dry pancake mix to the liquids and whisk to combine. Batter should be semi-thick and pourable. Set aside for 5-10 minutes to rest (don't skip this - it helps make the pancakes fluffy and delicious!).",
      "4. Meanwhile, heat a griddle, non-stick pan, or cast iron skillet over medium heat. Grease the pan lightly with avocado oil or vegan butter. Using a 1/3-cup measuring cup, scoop the batter onto the hot pan and cook until the edges are dry and the center is holding bubbles (about two minutes). Flip and cook on the other side for about 1 minute or until nicely browned.",
      "5. Serve warm with vegan butter, maple syrup, berry compote, peanut butter, or any of your favorite toppings!",
      "6. Store leftover (cooled) pancakes in an airtight container in the refrigerator for up to 2-3 days, or in the freezer for several weeks. Reheat in the toaster oven, microwave, or oven until hot."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Whole-Grain-Pancake-Mix-SQUARE.jpg",
    "description": "Quick and easy pancake mix that's naturally sweetened, totally vegan, and FULL of nutritious whole grains.",
    "serve": 15,
    "review": []
  },
  {
    "recipeName": "Easy Peach Scones (Gluten-Free, Vegan)",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "15 mins",
    "cookTime": "20 mins",
    "nutrition": "293 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 1/2 tsp flaxseed meal",
      "1 1/2 Tbsp water",
      "1/4 cup unsweetened dairy-free milk ((we used almond milk))",
      "1 tsp vanilla extract ((optional))",
      "1 1/4 cup almond flour ((if nut-free, see notes))",
      "3/4 cup potato starch* ((not potato flour))",
      "1/2 cup oat flour ((certified gluten-free as needed // if oat-free, see notes))",
      "2 1/2 tsp baking powder",
      "3 Tbsp organic cane sugar ((or sub coconut sugar, but they won't be as crisp and will be more brown in color))",
      "1/4 tsp sea salt",
      "3 Tbsp cold vegan butter ((we used Miyoko's // or sub room temperature coconut oil - needs to be scoopable, not liquid or frozen*))",
      "3/4 cup diced peaches ((fresh is best // if using frozen or canned, thaw and drain liquid))",
      "1 cup sifted organic powdered sugar",
      "1/2 tsp vanilla extract",
      "1-2 Tbsp dairy-free milk"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 400 degrees F (200 C) and line a baking sheet with parchment paper. Set aside.",
      "2. SCONES: In a small bowl, prepare the flax egg by combining flaxseed meal and water. Stir and let sit for a few minutes to gel. Then add the dairy-free milk and vanilla (optional).",
      "3. In a separate, larger mixing bowl, add almond flour, potato starch, oat flour, baking powder, cane sugar, and salt.",
      "4. Cut the cold vegan butter into cubes and add it to the dry ingredients. Using a fork or pastry cutter, cut the butter into the dry ingredients until only small bits remain.",
      "5. Whisk the dairy-free milk and flax mixture one more time and add to the dry ingredients, stirring with a wooden spoon until combined.",
      "6. Next, add the diced peaches and gently stir until evenly distributed. The moisture from the peaches will bind the dough more. Using extra ripe peaches may make it more moist, while using firmer, less-ripe peaches may make it more dry. You want the dough to be evenly moist but not overly sticky. If your dough is too crumbly, add a tablespoon more dairy-free milk at a time. If it's too wet/sticky, add more almond flour a tablespoon at a time.",
      "7. Gently transfer dough to an oat or almond floured surface. Shape into a disk about 3/4 to 1 inch in height. Cut the circle into 6 wedges (or 8 for smaller scones) and gently place them onto the baking sheet, spacing them out evenly. Option to sprinkle with a bit more organic cane sugar for a bit of a sweet crust.",
      "8. Bake for 18-22 minutes until fluffy and golden on the edges. Let cool on the baking sheet before digging in.",
      "9. VANILLA GLAZE: For the optional glaze, combine sifted organic powdered sugar, vanilla extract, and dairy-free milk of choice in a mixing bowl and whisk into a pourable glaze. If too thick, add more dairy-free milk. If too thin, add more powdered sugar. Drizzle over scones once cooled. Glaze will set in 30 minutes to 1 hour.",
      "10. Enjoy as is or serve with vegan butter and a cup of tea. These are best the day of but can be reheated the next day in a toaster oven or regular oven at 350 F for a few minutes (or enjoy at room temperature). Once completely cooled, store leftovers at room temperature in a well-sealed container for up to 3 days, or in the freezer for up to 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Gluten-Free-Peach-Scones-SQUARE.jpg",
    "description": "Perfectly sweet, easy to make gluten-free scones studded with ripe summer peaches.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Pesto Avocado Toast with Fresh Tomatoes",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "15 mins",
    "cookTime": null,
    "nutrition": "221 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "2 cups tightly packed fresh basil  ((large stems and buds removed // ~3 ounce or 85 g package as recipe is written))",
      "2-3 large cloves garlic, peeled",
      "1 Tbsp lemon juice",
      "2 Tbsp nutritional yeast",
      "1/4 tsp sea salt ((plus more to taste))",
      "1 Tbsp extra virgin olive oil",
      "1 Tbsp water ((plus more as needed // or sub additional olive oil))",
      "1 slice bread of choice",
      "1/4 - 1/3 large avocado, sliced ((ripe and green))",
      "2 Tbsp basil pesto ((ingredients listed above))",
      "1-2 slices tomato ((heirloom for best flavor // or baby cherry tomatoes))",
      "1 pinch sea salt",
      "1 pinch red pepper flakes"
    ],
    "recipeInstructions": [
      "1. PESTO: To a food processor or small blender, add the basil, garlic, lemon juice, nutritional yeast, and sea salt and blend/mix on high until a loose paste forms.",
      "2. Add olive oil a little at a time (streaming in while the machine is on if possible) and scrape down sides as needed. Then add water a little at a time until the desired consistency is reached - a loose, scoopable sauce that's not too thin or watery.",
      "3. AVOCADO TOAST: Toast bread in a toaster or in the oven until golden brown. Top with sliced avocado and use a fork to smash. Then add 2 tablespoons pesto (per slice of bread) and spread it over the avocado with a fork or spoon. Add sliced tomatoes and sprinkle with a pinch each of sea salt and red pepper flakes. Enjoy right away!",
      "4. Pesto can be made in advance and used for avocado toast throughout the week. Store leftover pesto in a sealed container in the refrigerator for up to 1 week. After that, pour into an ice cube tray, freeze, and store up to 1 month or more. Thaw at room temperature or in the refrigerator overnight."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/05/Pesto-Avocado-Toast-with-Tomatoes-SQUARE.jpg",
    "description": "Summer on toast: Smashed avocado is topped with zesty vegan pesto and tomatoes.",
    "serve": 1,
    "review": []
  },
  {
    "recipeName": "Fluffy Millet Breakfast Cake with Stone Fruit",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "20 mins",
    "cookTime": "40 mins",
    "nutrition": "312 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "3 Tbsp ground flaxseed ((or flaxseed meal))",
      "7 1/2 Tbsp water",
      "1/3 cup unsweetened plain almond milk",
      "1 Tbsp lemon juice",
      "1/3 cup maple syrup",
      "1/4 cup avocado oil ((if oil-free, you can try subbing applesauce, but we haven't tested it))",
      "2 tsp vanilla extract",
      "2 tsp lemon zest ((~1 small lemon))",
      "2 1/4 cups cooked &amp; cooled millet ((~3/4 cup dry as recipe is written // you could try subbing quinoa, but we haven't tested it))",
      "1 1/2 cups almond flour ((see notes for subs))",
      "1 Tbsp baking powder",
      "1/2 tsp sea salt",
      "1 1/2 cups stone fruit of choice, cut in 1/4-inch slices",
      "Coconut yogurt",
      "Vegan vanilla ice cream"
    ],
    "recipeInstructions": [
      "1. If you don't already have cooked millet, prepare it at this time on the stovetop or using our Instant Pot method.",
      "2. Preheat the oven to 375 F (190 C) and line a 9-inch springform pan with parchment paper. This recipe will also work in an 8-inch square baking dish.",
      "3. In a large mixing bowl, prepare flax eggs by stirring ground flaxseed and water together. Let gel for a few minutes.",
      "4. Measure the almond milk in a liquid measuring cup, add the lemon juice, mix gently, and let rest for a minute to curdle slightly.",
      "5. Add the almond milk and lemon juice to the flax eggs along with the maple syrup, avocado oil, vanilla extract, and lemon zest. Whisk vigorously until you see no separation between the oil and other ingredients - about 1 minute.",
      "6. Add the cooked and cooled millet and stir until evenly distributed. Add the almond flour, baking powder, and salt and mix once more until well combined. The batter will be thick and sticky (see photo). If it seems runny or too wet, add a bit more almond flour. If it is dry and crumbly, add more almond milk 1 tablespoon at a time.",
      "7. Transfer the batter to the parchment-lined pan and spread into an evenish layer - it's okay if the top is a bit uneven and rustic looking! Gently press the sliced fruit into the top of the batter, placing the slices close together but not overlapping.",
      "8. Bake for 40-50 minutes or until the edges are browning and the center of the cake is firm and dry. Remove from the oven and let cool for at least 20 minutes before removing from the pan and serving.",
      "9. Enjoy as part of a brunch feast or as a grain-filled, mid-morning snack with a scoop of coconut yogurt! As dessert, it's delightful slightly warmed and served with dairy-free ice cream. This cake is best served fresh but will keep at room temperature for up to 2-3 days or in the refrigerator for up to 4-5 days. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/05/Millet-Breakfast-Cake-SQUARE.jpg",
    "description": "Perfect for brunch, breakfast, snacking, and beyond.",
    "serve": 8,
    "review": []
  },
  {
    "recipeName": "Easy Vegan French Toast (10 Minutes!)",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "5 mins",
    "cookTime": "5 mins",
    "nutrition": "226 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "3 Tbsp cornstarch  ((cornstarch helps the batter crisp up // we haven't tested other starches))",
      "1/2 cup almond milk ((we also think you could use oat or coconut milk))",
      "2 tsp maple syrup",
      "1 tsp vanilla extract",
      "1/8 tsp black salt ((kala namak - adds eggy flavor // or sub sea salt))",
      "1/2 tsp ground cinnamon",
      "1 Tbsp mashed ripe banana",
      "1 dash ground turmeric ((optional // for color))",
      "2 large pieces sturdy day-old bread ((we recommend sourdough))",
      "2 tsp vegan butter ((we like Miyoko's with a hint of salt))",
      "Nut butter or vegan butter ((we like Miyoko's with a hint of salt // or sub nut butter))",
      "Fruit of choice ((sliced bananas, fresh berries, or compote))",
      "Maple syrup",
      "Organic powdered sugar",
      "Coconut whipped cream"
    ],
    "recipeInstructions": [
      "1. BATTER: To a shallow bowl or baking dish add cornstarch, then slowly add in dairy-free milk while whisking. Whisk fully to ensure there are no clumps. Then add maple syrup, vanilla extract, black salt (or sea salt), cinnamon, ripe mashed banana (adds custardy texture and subtle sweetness - leave out if you dislike banana), and turmeric (optional - for color). Whisk again to combine.",
      "2. Next, heat a large skillet over medium heat.",
      "3. DIP: In the meantime, add your bread slices to the batter and soak on each side for ~15-20 seconds. It shouldn't be super soggy, but they should be well coated. Option to dust each side with a bit more cinnamon.",
      "4. COOK: Add a bit of vegan butter to the hot skillet and as many pieces of French toast as will fit comfortably. Cook for ~2 minutes, or until the underside is golden brown. Then flip with a fork or spatula and cook for 2 minutes more, or until both sides are golden brown and caramelized. Repeat as needed until all French toast is prepared.",
      "5. SERVING: Serve as is, or (our preferred) with vegan butter or nut butter, fresh fruit, and maple syrup. You could also sprinkle with organic powdered sugar or add coconut whipped cream for a more decadent touch.",
      "6. STORAGE: Best when fresh. Not freezer friendly. You can make the batter up to 2 days in advance, though best when fresh. Enjoy!"
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/03/Vegan-French-Toast-SQUARE.jpg",
    "description": "Vegan French toast that's quick and easy delicious.",
    "serve": 2,
    "review": []
  },
  {
    "recipeName": "Golden Milk Overnight Oats",
    "author": "Minimalist Baker",
    "type": "Breakfast",
    "prepTime": "5 mins",
    "cookTime": "360 mins",
    "nutrition": "531 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1/2 cup light coconut milk ((we used unsweetened boxed))",
      "1 Tbsp chia seeds",
      "1 tsp golden milk spice mix ((see individual spices listed in notes))",
      "2 Tbsp almond butter ((or cashew butter))",
      "1 Tbsp maple syrup",
      "1/2 cup gluten-free rolled oats",
      "1/2 cup banana, sliced ((1/2 banana yields ~1/2 cup))",
      "2 Tbsp coconut flakes  ((optional))",
      "2 Tbsp coconut yogurt ((optional))",
      "1/4 cup unsweetened boxed coconut milk ((optional))",
      "1 tsp maple syrup ((optional))"
    ],
    "recipeInstructions": [
      "1. To a jar or small bowl with a lid, add the coconut milk, chia seeds, golden milk spices (see notes for individual spices), almond butter, and maple syrup. Stir until the spices are incorporated into the milk. Some larger swirls of almond butter are okay.",
      "2. Add the rolled oats and stir to combine. Press down with a spoon to ensure all oats have been moistened and are immersed in the coconut milk.",
      "3. Cover securely with a lid or seal and store in the refrigerator overnight, or for at least 6 hours.",
      "4. The next day, remove from the refrigerator and top with sliced banana. Optionally, garnish with coconut flakes, coconut yogurt, additional coconut milk, and/or a drizzle of maple syrup. Enjoy! Best within 24-48 hours. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/04/Golden-Milk-Overnight-Oats-SQUARE.jpg",
    "description": "Warming golden milk spices infused into creamy overnight oats.",
    "serve": 1,
    "review": []
  },
  {
    "recipeName": "Italian Herb Tofu Wraps with Garlicky Hummus Sauce",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "15 mins",
    "cookTime": null,
    "nutrition": "521 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "4 (~8-inch) wraps of choice",
      "1 batch Crispy Baked Tofu with Italian Herbs",
      "4 large lettuce leaves",
      "1 cup chopped tomato",
      "1/4 cup finely chopped pepperoncini ((optional))",
      "1/2 cup plain hummus ((we used Hope brand))",
      "1 1/2 Tbsp olive oil",
      "2 tsp apple cider vinegar",
      "2 small cloves garlic, crushed or minced",
      "1 healthy pinch each sea salt and black pepper ((plus more to taste))",
      "3/4 tsp maple syrup ((optional))"
    ],
    "recipeInstructions": [
      "1. FLATBREADS: If you want to make homemade flatbread, prepare it at this time (Garlic Herb or Gluten-Free) and set aside. It can be made up to 3 days in advance. Or use store-bought for ease!",
      "2. TOFU: If you don't already have a batch of Crispy Baked Tofu with Italian Herbs, prepare it at this time and set aside. It can be made up to 3-4 days in advance.",
      "3. SAUCE: To a small mixing bowl, add hummus, olive oil, apple cider vinegar, crushed or minced garlic, salt and pepper, and maple syrup (optional for balance). Whisk to combine into a smooth, pourable sauce, adding a little water if it's too thick or hummus if too thin. Taste and adjust as needed, adding apple cider vinegar for brightness, garlic for zing, maple syrup for sweetness, or salt or pepper to taste.",
      "4. WRAPS: Assemble the wraps by stacking each wrap (pita or flatbread) with 1 lettuce leaf, ~1/2 cup Crispy Baked Tofu, 1/4 cup chopped tomato, and 1 Tbsp pepperoncini (optional). Then top each wrap with ~2-3 Tbsp sauce and enjoy!",
      "5. These wraps are best when fresh, but the components can be prepared ahead of time and stored separately up to 3-4 days. The tofu and flatbreads are also freezer friendly!"
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2022/01/Italian-Herbed-Tofu-Wrap-SQUARE.jpg",
    "description": "Perfect for an easy lunch or dinner, and full of savory, plant-based satisfaction.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Easy Vegan 'Tuna' Melt",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "10 mins",
    "cookTime": "20 mins",
    "nutrition": "513 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "1 batch Easy Vegan Cheddar Cheese",
      "1 (15-oz.) can chickpeas, thoroughly rinsed and drained",
      "2 Tbsp vegan mayonnaise ((for store-bought, we like Follow Your Heart Vegenaise))",
      "1 tsp dijon mustard",
      "1/8 tsp each sea salt and black pepper",
      "1-2 Tbsp finely chopped shallot ((or sub red onion))",
      "2 Tbsp finely chopped dill pickles",
      "8 slices of bread",
      "4 Tbsp vegan butter"
    ],
    "recipeInstructions": [
      "1. If you want to use the Easy Vegan Cheddar Cheese and haven't already made it, start making it now. Then it's sandwich time!",
      "2. Thoroughly rinse and drain your chickpeas and pat them dry with a clean kitchen towel to remove excess liquid. Place the chickpeas in a medium mixing bowl and use a potato masher or fork to mash them until no large pieces of chickpeas remain but before it becomes too smooth or pasty - you want some texture.",
      "3. To the chickpeas, add the vegan mayonnaise, mustard, salt and pepper, shallot, and pickles, and mix thoroughly. Taste and adjust, adding more mayonnaise for creaminess, dijon for brightness, or black pepper for a kick.",
      "4. Heat a medium cast iron or non-stick skillet over medium heat.",
      "5. In the meantime, butter one side of each slice of bread. Once the skillet is hot, place a slice of bread butter side down in the pan, then carefully spread a semi-thick layer (3-4 Tbsp) of vegan cheddar cheese on the bread (or place a slice or two of cheese down if using store bought). Top the cheese with a heaping 1/3 cup of the vegan 'tuna,' spreading it out evenly with a fork. Place another slice of bread, butter side up, on top of the 'tuna.'", 
      "6. Cook the sandwich over medium heat for 2-3 minutes, peeking at the underside of the bread to see if it's getting nicely toasty. Once the bottom slice of bread is golden, flip! Cook for another 2-3 minutes, until both sides are nice and golden brown and crispy and the cheese appears melty and gooey (covering the pan can help melt the cheese; lower the heat as needed if browning too quickly).",
      "7. Repeat with remaining bread, cheese, and 'tuna.' Then enjoy! These sandwiches pair beautifully with soup or salads.",
      "8. Best when fresh. Chickpea 'tuna' can be made ahead and stored in a sealed container in the refrigerator for 2-3 days. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/11/Easy-Tuna-Melt-SQUARE.jpg",
    "description": "A savory, cheesy Vegan 'Tuna' Melt made with smashed chickpeas.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Creamy Chipotle Tomato Soup (1 Pot!)",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "15 mins",
    "cookTime": "30 mins",
    "nutrition": "137 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 Tbsp olive oil",
      "1 small white or yellow onion, finely diced ((1 small onion yields ~150 g or 1 cup))",
      "2 stalks celery, finely diced ((2 stalks celery yield ~3/4 cup or 90 g))",
      "1 medium carrot, finely diced  ((1 medium carrot yields ~3/4 cup or 100 g))",
      "3 cloves garlic, finely minced",
      "1/2 tsp sea salt",
      "1/2 tsp dried oregano",
      "1-2 chipotle peppers in adobo sauce ((canned // adjust depending on your spice preference))",
      "1 Tbsp adobo sauce ((from a can of chipotle peppers in adobo))",
      "2 (14.5-oz) cans fire-roasted diced tomatoes",
      "2 1/2 cups water",
      "3/4 cup canned full-fat coconut milk",
      "Swirls of coconut milk and/or adobo sauce",
      "Chili Lime Roasted Pepitas",
      "Garlic Bread"
    ],
    "recipeInstructions": [
      "1. In a large pot or Dutch oven, heat olive oil over medium-low heat. Add onion and cook, stirring occasionally, until softened and translucent - about 3 minutes. Add the celery and carrots, and stir to combine. Turn the heat to medium and sauté for 4-5 minutes, or until the veggies are fragrant and brightened in color.",
      "2. Add the garlic, salt, oregano, chipotle pepper(s), and adobo sauce. Mix well, and smash the chipotle pepper with a wooden spoon to break it up slightly. Cook for 2 minutes more.",
      "3. Add the fire-roasted tomatoes and the water, and stir. Bring to a boil, then reduce to a simmer and cover, cooking for 10 minutes, or until the carrots are very tender.",
      "4. Turn off the heat and use an immersion blender to purée the soup (or if using a regular blender, let the soup cool for at least 10 minutes first to avoid an explosion). Using a high-speed blender will give you a smoother soup! But we don't mind the slight texture the immersion blender leaves behind.",
      "5. Once the soup is blended, add the coconut milk and return the soup to a slight simmer, just to heat it through. Enjoy warm! It's delicious served with grilled &quot;cheese&quot; sandwiches, vegan &quot;tuna&quot; melts, or garlic bread. Optionally, garnish with swirls of coconut milk and adobo sauce (if you like it extra spicy!) and Chili Lime Roasted Pepitas.",
      "6. Leftover soup will keep in a sealed container in the refrigerator for 3-4 days or in the freezer for up to 1 month. Reheat on the stovetop or in the microwave until warmed through."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/11/Creamy-Chipotle-Tomato-Soup-SQUARE.jpg",
    "description": "A creamy, spicy tomato soup that's a delicious new twist on a classic.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Smoky BBQ Bean Tacos (Vegan, GF)",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "10 mins",
    "cookTime": "15 mins",
    "nutrition": "167 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 Tbsp avocado oil",
      "1 cup diced white onion",
      "1-4 chipotle peppers in adobo, roughly chopped",
      "1 tsp ground cumin",
      "1 Tbsp smoked paprika",
      "1 (15-ounce) can pinto beans, drained and rinsed",
      "1/2 cup water",
      "1 Tbsp maple syrup",
      "1/2 tsp sea salt",
      "1 Tbsp lime juice",
      "5 corn tortillas",
      "Jicama slaw ((optional))",
      "Guacamole ((optional))"
    ],
    "recipeInstructions": [
      "1. Heat the avocado oil in a large skillet over medium heat. Add the onion and sauté for 4 minutes, until translucent and beginning to soften.",
      "2. Add the chopped chipotles in adobo (use the lesser amount if sensitive to spice), cumin, and smoked paprika, and cook until fragrant - about 1 minute.",
      "3. Add the drained pinto beans, water (or vegetable broth), maple syrup, and salt and stir to combine. Cook for 7-8 minutes, until warmed through and slightly thickened. Add the lime juice, stir, and season to taste, adding more paprika for smokiness, minced chipotle pepper for heat, or lime juice for brightness.",
      "4. When the beans are ready (tender and well seasoned), warm tortillas by wrapping in a damp paper towel (or kitchen towel) and microwaving for 30 seconds to 1 minute. If using fresh or homemade tortillas, you can warm them one at a time in a cast iron skillet over high heat for 10-20 seconds on each side (or until just warmed), then wrap in a towel to keep warm until serving.",
      "5. Divide beans between warmed corn tortillas and serve with toppings of your choice (jicama slaw and guacamole are our favorites!). Leftover beans will keep in the refrigerator for 3 days or in the freezer for 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Smoky-BBQ-Bean-Tacos-SQUARE.jpg",
    "description": "Smoky BBQ bean tacos pack serious, saucy flavor.",
    "serve": 5,
    "review": []
  },
  {
    "recipeName": "Creamy Summer Salad (with Crispy BBQ Chickpeas)",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "25 mins",
    "cookTime": null,
    "nutrition": "300 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 batch Crispy BBQ Chickpeas",
      "3 Tbsp coconut aminos",
      "1/2 cup lime juice",
      "6 Tbsp tahini",
      "1 pinch each sea salt and black pepper",
      "1 cup chopped green beans, cut into 1/2-inch pieces",
      "1 cup chopped red bell pepper, cut into 1/2-inch pieces ((or sub other bell pepper))",
      "1 cup chopped zucchini, cut into 1/2-inch pieces ((or sub cucumber))",
      "1 cup chopped radishes, cut into 1/2-inch pieces",
      "1 cup fresh corn kernels cut from the cob",
      "1 cup chopped fresh pineapple, cut into 1/2-inch pieces ((can try subbing other summer fruit, such as stone fruit or mango))"
    ],
    "recipeInstructions": [
      "1. If you are serving with Crispy BBQ Chickpeas, prepare those first. While they bake in the oven, start on the salad!",
      "2. In a large mixing bowl, add coconut aminos, lime juice, tahini, and salt and pepper and whisk until well combined and smooth. Taste and adjust, adding more salt and pepper to taste, lime juice for zing/acidity, or coconut aminos for sweetness/depth of flavor.",
      "3. Add in chopped green beans, bell pepper, zucchini, radishes, corn, and pineapple. Stir gently to evenly coat salad ingredients with dressing. Place your salad in the refrigerator while you finish the Crispy BBQ Chickpeas.",
      "4. Once the chickpeas are seasoned and cooled, add them to the salad. Enjoy the salad on its own or alongside other classic barbecue fare like vegan burgers and potato salad.",
      "5. Best when fresh. If preparing in advance, store chickpeas and salad separately. Store salad in the refrigerator for up to 3 days and chickpeas in a sealed container at room temperature for up to 4-5 days."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/05/Summer-Chopped-Salad-SQUARE.jpg",
    "description": "The ultimate fresh, no-fuss summer chopped salad with crisp veggies and a zingy lime-tahini dressing.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Garlic &amp; Herb Sweet Potato Nourish Bowl (30 Minutes!)",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "5 mins",
    "cookTime": "25 mins",
    "nutrition": "412 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 medium sweet potato, halved  ((skin on))",
      "1/4 tsp avocado oil",
      "1 cup finely chopped parsley",
      "1/3 cup chopped red bell pepper or cherry tomatoes",
      "3 Tbsp diced red onion",
      "1 1/2 Tbsp lemon juice",
      "1 healthy pinch each sea salt and black pepper",
      "1/2 batch 4-Ingredient Dill Garlic Sauce",
      "2 cups chopped romaine ((we like romaine hearts))",
      "2 Tbsp hummus  ((or store-bought))",
      "1 Tbsp sauerkraut ((or sub store-bought))",
      "1 Tbsp tahini",
      "2-3 tsp za'atar  ((or sub store-bought))",
      "Lemon wedges ((optional))",
      "1 Tbsp dulse ((or other sea vegetable or sprout of choice // optional))",
      "Chili garlic sauce ((optional))"
    ],
    "recipeInstructions": [
      "1. Heat oven to 400 degrees F (204 C // if you have convection, use it to speed cook time) and line a small baking sheet with parchment paper. Add halved sweet potato and rub with a little oil to coat (if your sweet potato is large, cut into quarters or large wedges to speed bake time). Then bake for ~25 minutes or until tender.",
      "2. In the meantime, prepare parsley salad by adding parsley, red bell pepper, red onion, lemon juice, salt, and pepper to a small mixing bowl and tossing to combine. Add more lemon or salt to taste if needed. Set aside.",
      "3. Next, prepare dill garlic sauce by adding the hummus, lemon juice, fresh or dried dill, and minced garlic to a small mixing bowl and stirring to combine. Taste and adjust flavor as needed, adding salt to taste (only if needed), lemon juice for more acidity, garlic for bite, or dill for a more intense herb flavor. If the flavors are too strong, dilute with a little hummus. The sauce should be pourable, so add a bit of water to thin if needed.",
      "4. To serve, add the chopped romaine to a large serving bowl along with parsley salad, roasted sweet potato, hummus, sauerkraut, tahini, and za'atar. Optional: You can also serve with lemon wedges and top with dulse and/or chili garlic sauce. Serve with the dill garlic sauce.",
      "5. Best when fresh. Store leftovers covered in the refrigerator, keeping the sauce and sweet potato separate from the greens / parsley salad. Sweet potatoes will last for 2-3 days, greens for 3-4 days, and sauce for 4-5 days. Reheat sweet potato in a 375 degree (190 C) oven or on the stovetop over medium heat until hot."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2020/07/Garlic-Herb-Sweet-Potato-Nourish-Bowl-SQUARE.jpg",
    "description": "Bowl with greens, parsley salad, za'atar, hummus, and dill garlic sauce.",
    "serve": 1,
    "review": []
  },
  {
    "recipeName": "Easy Massaged Kale Salad (15 Minutes!)",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "15 mins",
    "cookTime": null,
    "nutrition": "183 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "2 large bundles curly kale*, large stems removed and roughly chopped",
      "1 Tbsp lemon juice",
      "1 Tbsp extra virgin olive oil  ((if avoiding oil, omit))",
      "1 healthy pinch sea salt",
      "1/3 cup tahini  ((see our Tahini Review!))",
      "3 Tbsp lemon juice",
      "1-2 Tbsp maple syrup  ((or sub agave, or honey if not vegan))",
      "1 pinch sea salt  ((optional))",
      "Water to thin  ((~3-6 Tbsp or 45-90 ml as original recipe is written))",
      "Crispy Baked Chickpeas"
    ],
    "recipeInstructions": [
      "1. Once you've rinsed and dried your kale, run your hand along the stem to remove the green leaves from the stalky stem. You don't have to remove the stem completely (we actually enjoy the top 2/3 in the salad), but be sure to compost or reserve the larger bottom stalks for DIY vegetable broth.",
      "2. Stack your stalks of kale on top of each other and finely chop. No need to mince, just cut into manageable, bite-size pieces.",
      "3. Add kale to a large mixing / serving bowl and top with lemon juice and extra virgin olive oil. Then massage with clean hands for about 3 minutes. The point of massaging is to infuse the kale with the lemon juice and oil, and also to break down some of the tough, fibrous characteristics of kale. This makes it easier to chew and digest, and makes for a more tender salad. Season with salt, massage/toss once more, then set aside.",
      "4. Next prepare the dressing by adding tahini, lemon juice, maple syrup, and salt (optional) to a medium mixing bowl. Whisk to combine. Then slowly add water until creamy and pourable. The mixture may seize up and thicken at first, but continue adding water a little at a time, whisking until creamy and smooth. Taste and adjust flavor as needed, adding more lemon juice for acidity, maple syrup for sweetness, or salt to taste. Set aside. (Store leftover dressing in the refrigerator up to 5-7 days - sometimes longer.)",
      "5. To serve, top with desired amount of dressing and crispy chickpeas (optional), toss, and serve. Leftovers keep covered in the refrigerator up to 3-4 days (not freezer friendly). We enjoy leftovers chilled, but also find that they sauté nicely (even with the dressing and chickpeas) if you're looking for a cooked version."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2019/12/Massaged-Kale-Salad-SQUARE.jpg",
    "description": "Everything you need to know about massaged kale salads.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Kale Falafel Hummus Wraps",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "15 mins",
    "cookTime": "15 mins",
    "nutrition": "421 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "4 cups loosely packed kale, stems removed and torn",
      "4 large cloves garlic, skins removed  ((4 large cloves yield ~2 Tbsp or 12 g))",
      "1 15-ounce can chickpeas, rinsed and drained  ((~1 1/2 cups as recipe is written))",
      "1 1/2 Tbsp tahini",
      "3 Tbsp fresh lemon juice",
      "1/2 tsp ground cumin",
      "1/2 tsp sea salt",
      "1/4-1/2 cup oat flour  ((ground from rolled oats // or all purpose if not gluten free))",
      "2-4 Tbsp avocado or olive oil  ((for cooking))",
      "Hummus ((or store-bought // for topping))",
      "4 medium pitas  ((white or wheat // sub rainbow chard for gluten-free option)*)",
      "Greens of choice  ((such as fresh parsley or lettuce))"
    ],
    "recipeInstructions": [
      "1. Add kale and garlic to a food processor and pulse to chop into small bits. Then add chickpeas, tahini, lemon juice, cumin, and salt and pulse to combine. Mixture shouldn't be puréed, just combined.",
      "2. Once incorporated, transfer mixture to a medium mixing bowl (or stir directly in food processor) and introduce 1/4 cup oat flour (amount as original recipe is written // adjust if altering batch size). Add oat flour another 1 Tbsp (5.6 g) at a time until the mixture is thick enough to handle&nbsp;- adding roughly 2-4 Tbsp.",
      "3. Taste and adjust seasonings as desired. I added a touch more salt, cumin, and lemon juice. Scoop out heaping 2-Tbsp portions of falafel dough and use your hands to form them into approximately 1/2-inch thick patties. As written, recipe makes ~9 falafel.",
      "4. NOTE: If not cooking all of the falafel right away, FREEZE uncooked falafel between layers of parchment paper and store in a container in the freezer up to 1 month. Then just thaw and cook as instructed!",
      "5. Heat a large skillet over medium to medium-high heat. Once hot, add 2 Tbsp oil (or lesser end of range if adjusting batch size). Swirl to coat pan. Add 4 falafel (or however many will fit comfortably) to the pan at a time.",
      "6. Cook until browned on the bottom, checking at the 2-minute mark to ensure they're not over-browning. If they are, slightly reduce heat. Flip once they're deep golden brown&nbsp;- about 3-4 minutes. Cook until the other side is golden brown as well.",
      "7. To assemble, lay pita (or chard) flat, top with 2-3 falafel, a healthy spread of hummus, and greens or herbs, and roll up. Secure with a toothpick or wrap with parchment or foil for easy handling. Store leftover falafel covered in the refrigerator for up to 4-5 days and reheat in a 350 degree F (176 C) oven. See freezing instructions in step 4.&nbsp;"
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2019/04/Kale-Falafel-Hummus-Wraps-SQUARE.jpeg",
    "description": "Made with kale and chickpeas, so satisfying.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Easy Tofu Pad Thai",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "20 mins",
    "cookTime": "10 mins",
    "nutrition": "461 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 1/2 tsp tamarind paste / concentrate* ((or sub additional 1 Tbsp / 15 ml lime juice as recipe is written))",
      "1/3 cup coconut aminos  ((or sub half the amount with tamari or soy sauce and work your way up as it's saltier))",
      "3 1/2 Tbsp coconut sugar",
      "1 1/2 tsp chili garlic sauce",
      "1 1/2 Tbsp lime juice",
      "1-2 tsp Vegetarian Fish Sauce (( or store-bought // optional))",
      "1 Tbsp sesame oil  ((if avoiding oil, omit and use a nonstick pan))",
      "1 cup cubed extra firm tofu",
      "2 Thai red chilies (fresh or dried), chopped OR 1/2 tsp chili flakes ((optional))",
      "2 cloves garlic, minced  ((2 cloves yield ~1 Tbsp or 6 g))",
      "1 Tbsp coconut aminos  ((or tamari))",
      "1 cup bean sprouts",
      "1 cup chopped green onions",
      "1/3 cup chopped roasted salted peanuts",
      "8 ounces Pad Thai rice noodles  ((We like Annie Chun's brand))",
      "Lime wedges",
      "Bean sprouts",
      "Peanut sauce",
      "Shredded carrot",
      "Cilantro",
      "Sriracha or Chili Garlic Sauce  ((we like Huy Fong Foods brand))"
    ],
    "recipeInstructions": [
      "1. To a small saucepan, add tamarind, coconut aminos, coconut sugar, chili garlic sauce, lime juice, and vegetarian fish sauce (optional) and heat over medium heat until just simmering. Cook for 30 seconds, stirring occasionally, then turn off heat. Set aside.",
      "2. Ensure all stir fry ingredients are prepped, including cubed (briefly&nbsp;pressed) tofu, chopped green onions, minced garlic, bean sprouts, and chopped peanuts. If serving with peanut sauce (optional), prepare at this time.",
      "3. Add Pad Thai noodles to a large bowl and cover with just boiling water. Stir and cover and cook according to package instructions (usually about 5-6 minutes or until al dente).",
      "4. Drain noodles and toss with a little sesame oil to prevent sticking. Set aside.",
      "5. Heat a large-rimmed skillet over medium heat. Once hot, add oil and tofu and sauté for about 4 minutes, turning occasionally so it browns on all sides. Add red pepper flakes or Thai chilies, garlic, and coconut aminos (be careful, as the coconut aminos can splatter). Toss gently to combine until garlic is just slightly browned.&nbsp;",
      "6. Add noodles, Pad Thai sauce, bean sprouts, green onions, and peanuts and cook over medium-high heat, tossing occasionally (tongs are most useful) for about 2-3 minutes or until the sauce has coated everything and the dish is hot.",
      "7. To serve, plate with additional garnishes such as lime wedges, bean sprouts, peanut sauce, shredded carrot, cilantro, and sriracha or chili garlic sauce (all optional).",
      "8. Leftovers will keep in the refrigerator for approximately 3-4 days."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2019/01/Easy-Vegan-Pad-Thai-SQUARE.jpg",
    "description": "Easy Tofu Pad Thai with simple ingredients.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Roasted Squash Arugula Salad with Crispy Shallot and Balsamic Reduction",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "10 mins",
    "cookTime": "20 mins",
    "nutrition": "311 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 medium acorn squash  ((or similar winter squash // pick one with green and orange skin))",
      "1 Tbsp avocado or olive oil",
      "1 pinch each salt and black pepper",
      "1 cup balsamic vinegar",
      "2 medium shallots ((thinly sliced))",
      "3 Tbsp brown rice flour",
      "1/8 tsp each sea salt",
      "~2 Tbsp olive oil or avocado oil  ((for cooking - if avoiding oil, omit and use a non-stick pan))",
      "1/4 cup macadamia nut cheese  ((or similar store-bought))",
      "2 Tbsp roasted or raw pepitas  ((we preferred roasted))",
      "5-6 cups arugula",
      "2 Tbsp dried currants  ((or other dried fruit, such as cranberries))"
    ],
    "recipeInstructions": [
      "1. Preheat oven to 425 F (218 C). To prepare squash,&nbsp;use a sharp knife to carefully cut in half lengthwise (from root to tip), then remove seeds with a spoon or ice scream scooper. Slice squash halves into even wedges and leave the skin on.",
      "2. Arrange squash on a parchment-lined baking sheet. Sprinkle with oil, salt, and pepper and toss to coat. Spread in an even layer.Roast squash for ~15-20 minutes or until tender and golden brown.",
      "3. In the meantime, prepare dressing by adding balsamic vinegar to a small saucepan. Bring to a gentle boil. Then allow to simmer until it is reduced by half and looks thick (about 10-15 minutes). Watch carefully near the end as it can go from reduced to burnt quickly. You'll know it's done when, swirled, it coats the sides of the pan.",
      "4. At this time, prepare the nut cheese (link to recipe above), or if using store-bought, skip this step.",
      "5. If toasting pepitas, add to a dry skillet over medium heat and cook, stirring occasionally, until lightly browned - about 3-5 minutes (being careful not to burn).",
      "6. Next, add sliced shallots to a small bowl with brown rice flour, salt, and pepper and toss to coat. Heat a medium (preferably cast-iron) skillet over medium heat. Once hot, add oil and floured shallots and sauté, stirring occasionally, until lightly golden brown and crispy - ~5 minutes.",
      "7. To serve, arrange arugula on a platter or serving bowl and top with roasted squash, crispy shallots, dollops of macadamia nut cheese, pepitas, and cranberries or currants. Drizzle with dressing.",
      "8. Best when fresh, but leftovers can be stored covered in the refrigerator up to 2-3 days (preferably without dressing and squash separate from greens)."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2018/09/Roasted-Squash-Salad-with-Balsamic-Reduction-SQUARE.jpg",
    "description": "An incredibly flavorful fall roasted squash salad with macadamia nut cheese.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Black Bean & Plantain Arepa Sandwiches",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "15 mins",
    "cookTime": "15 mins",
    "nutrition": "459 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "6 large arepas ((or you could sub corn tortillas))",
      "2 large ripe and spotty plantains, peeled",
      "1 Tbsp oil ((avocado is my preferred))",
      "1 15-ounce can black beans, slightly drained",
      "1/2 tsp ground cumin",
      "1 Pinch sea salt",
      "2 ripe avocados",
      "2-3 Tbsp lime juice",
      "1/4 tsp sea salt ((plus more to taste))",
      "1/4 cup diced onion",
      "2  Tbsp chopped cilantro",
      "Cabbage",
      "Cilantro",
      "Habanero Hot Sauce ((or other hot sauce))"
    ],
    "recipeInstructions": [
      "1. If you haven't already prepared your arepas, which take about 30 minutes (not included in prep time), do that now.",
      "2. Preheat oven to 400 degrees F (209 C). Peel your plantains and slice on a diagonal into 1/2-inch pieces. Then add to a parchment-lined baking sheet and toss with oil. Arrange into an even layer and bake for about 15-20 minutes or until golden brown and caramelized. Toss near the 10-minute point to ensure even baking.",
      "3. In the meantime, add (slightly drained) black beans to a small saucepan and heat over medium heat until bubbly and hot. Season with cumin and salt and stir to combine. Then turn heat off and set aside (cover to keep warm).",
      "4. Lastly, prepare guacamole by mashing avocado in a small mixing bowl and adding lime, salt, onion, and cilantro. Stir to combine, and taste and adjust flavor as needed. Add more salt for saltiness, lime for acidity, or onion for crunch. Set aside.",
      "5. You're ready to serve. Slice your hot arepas in half (or cut a \"pita pocket\" and stuff). Add guacamole, beans, plantains, and any other desired toppings, such as Habanero Hot Sauce, cabbage, or cilantro!",
      "6. Best when fresh. Store leftovers (separate from each other) in the refrigerator up to 3 days.&nbsp;"
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2018/08/Arepa-Sandwiches-SQUARE.jpg",
    "description": "Arepa sandwiches with roasted plantains, smoky black beans, guacamole, and habanero hot sauce.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Roasted Broccoli Pasta Salad with Hemp Pesto (V/GF)",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "15 mins",
    "cookTime": "35 mins",
    "nutrition": "224 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 small heads organic broccoli, chopped  ((~7 cups chopped))",
      "1-2 Tbsp olive oil",
      "1/4 tsp each sea salt and black pepper",
      "2 tsp salt  ((for salting water))",
      "1 1/2 cups (dry) gluten-free pasta  ((we like Trader Joe's brown rice quinoa fusilli))",
      "2 (heaping) cups packed  basil",
      "4 cloves garlic, skins removed  ((4 cloves yield ~2 Tbsp))",
      "1/4 cup hemp seeds  ((or pine nuts))",
      "2 Tbsp lemon juice",
      "3-4 Tbsp nutritional yeast",
      "1/4 tsp sea salt (plus more to taste)",
      "3-4 Tbsp olive oil  ((if avoiding oil, sub water))",
      "2/3 cup sun-dried tomatoes  ((if in oil, pat dry // we like Trader Joe's brand))",
      "1/2 cup macadamia nut cheese ((optional))",
      "1 sprinkle red pepper flake ((optional))"
    ],
    "recipeInstructions": [
      "1. Heat oven to 400 degrees F (204 C). Line a baking sheet with parchment paper. Add broccoli and toss with oil, salt, and pepper. Once oven is preheated, add broccoli and cook for 15 minutes or until lightly golden browned.",
      "2. In the meantime, bring a small pot of water to a boil and add salt (to season the water and the pasta). Once boiling, add the pasta, stir, and cook according to package instructions or until al dente. Drain and set aside.",
      "3. In the meantime, prepare pesto. Add basil, garlic, hemp seeds, lemon juice, nutritional yeast, and sea salt to a food processor and mix to combine. Then stream in olive oil a little at a time until a creamy paste is achieved. Scrape down sides as needed. Taste and adjust flavor as needed, adding more salt to taste, nutritional yeast for cheesiness, hemp seeds or basil to thicken, garlic for kick, or lemon juice for acidity. Cover with lid and set aside.",
      "4. Once broccoli is roasted, cool slightly then add to a large serving / mixing bowl. Then add cooked drained pasta, sun-dried tomatoes, little spoonfuls of macadamia nut cheese (optional), and red pepper flake (optional). Top with pesto and toss gently to combine (being careful to not break the pasta).",
      "5. Enjoy immediately or refrigerate up to 3-4 days (not freezer friendly). Enjoy chilled or at room temperature."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2019/11/Pesto-Broccoli-Salad-SQUARE.jpg",
    "description": "Plant-based salad with roasted broccoli, sun-dried tomatoes, and vegan pesto.",
    "serve": 8,
    "review": []
  },
  {
    "recipeName": "Savory Chickpea Pancakes with Leek and Mushrooms",
    "author": "Minimalist Baker",
    "type": "Lunch",
    "prepTime": "20 mins",
    "cookTime": "25 mins",
    "nutrition": "176 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 cup chickpea flour",
      "1/2 teaspoon sea salt, plus more to taste",
      "1 1/2 cups warm water",
      "1 Tbsp olive oil, plus more for greasing pan",
      "8 ounces sliced mushrooms ((we used shiitake))",
      "2 small leeks, sliced into 1/4-inch half moons",
      "2 cloves garlic, minced",
      "1 tsp dried thyme ((or sub twice as much fresh))",
      "3 Tbsp nutritional yeast",
      "1 pinch each sea salt and black pepper",
      "Fresh thyme",
      "Sliced green onion"
    ],
    "recipeInstructions": [
      "1. In a medium mixing bowl, whisk together the chickpea flour, salt, and warm water until smooth. Ensure that the water is warm as it will help the batter thicken correctly. Set aside for 15 minutes.",
      "2. Meanwhile, heat olive oil in a large skillet over medium heat. Add the mushrooms, leeks, and a pinch each of salt and pepper. Reduce the heat to low and cook, stirring often, until softened - about 10 minutes.",
      "3. Add the garlic and thyme and cook for 1-2 more minutes. Turn off the heat and stir in the nutritional yeast. Taste and adjust as needed, adding more salt to taste, black pepper for spice, or nutritional yeast for cheesiness. Set aside.",
      "4. Heat a non-stick or cast iron* skillet over medium heat (non-stick works best). Whisk the batter again to combine. It should be fairly loose. Pour 1/2 tsp of olive oil into the pan and rotate the pan to evenly spread the oil (if using a cast iron, we found a very thin coating of oil to work best - in fact, in most cases, a seasoned surface with no additional oil should work well).",
      "5. Scoop 1/3 cup (80 ml) of the batter into the skillet, quickly pick up and rotate the skillet to spread the batter into a 5-7 inch circle, then turn up the heat to medium-high and cook the pancake, undisturbed, until browned on the bottom and edges, about 2-3 minutes. Use a spatula to peek at the underside of the pancake to make sure it's browned before flipping - the pancake should lift away from the pan easily; if it sticks, let it cook a bit longer. Once ready, flip and cook for 1 minute on the other side. If you are using cast iron and the batter is sticking, wipe a small amount of olive oil across the entire surface of the pan and try again. Transfer finished pancake to a plate, turn the heat back down to medium, and repeat with the remaining batter.",
      "6. Top the pancakes with the leek and mushroom filling and garnish with fresh thyme and nutritional yeast or green onion if desired.",
      "7. Best when fresh. Leftovers will keep stored separately in the refrigerator for up to 2-3 days. Not freezer friendly. Reheat separately on the stovetop until warmed."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/04/Chickpea-Pancake-SQUARE.jpg",
    "description": "Perfect chickpea pancakes that are tender with crisp edges.",
    "serve": 5,
    "review": []
  },
  {
    "recipeName": "Dark Chocolate Amaranth Bars (6 Ingredients!)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "65 mins",
    "cookTime": "10 mins",
    "nutrition": "100 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "6-7 Tbsp uncooked amaranth  ((6-7 Tbsp uncooked yields ~1 1/4 cup or 65 g popped/puffed))",
      "1/2 cup dark chocolate chips or pieces",
      "1/4 cup creamy unsweetened almond butter ((if nut-free, sub sunflower seed butter))",
      "1 Tbsp coconut oil",
      "1 healthy pinch sea salt",
      "1/2 tsp vanilla extract"
    ],
    "recipeInstructions": [
      "1. Line a standard-size loaf pan or similar-sized dish (~8 1/2 x 4 1/2 inches) with parchment paper and set aside.",
      "2. To pop the amaranth, heat a large rimmed skillet (or large saucepan) over medium-high heat. Set a medium mixing bowl to the side for the popped amaranth. Once the pan is hot (give it at least 3-5 minutes to heat up), add 1 Tbsp (10 g) unpopped amaranth and immediately cover with a lid. Shake/slide the pot back and forth over the heat (wearing oven mitts can be helpful) to move the grain around. It should start popping within 1-3 seconds and be done popping at the 10-second mark (if it's not, that means the pan isn't hot enough). Quickly empty into the mixing bowl.",
      "3. Be sure to pull the amaranth off the heat at around 10 seconds (or when the unpopped grains are turning from golden to dark brown) or the amaranth will burn. It's okay if not every single grain has popped. It may take a couple tries to dial in your heat and not burn the grains, but then you'll hit your stride!",
      "4. Continue until you have roughly 1 1/4 cup (65 g) popped grain (adjust amount if altering number of servings).",
      "5. Add 1 inch of water to a small saucepan and bring to a low boil. Once boiling, reduce heat to a simmer. Place a small glass or metal bowl over the saucepan and add the chocolate chips, almond butter, and coconut oil. Heat, stirring occasionally with a spatula or spoon, until melted and no lumps remain (~3-5 minutes). You can also melt them in a heat-proof glass bowl in the microwave in 20-second increments.",
      "6. Once melted, stir in the salt and vanilla and carefully remove from the heat. Pour the chocolate mixture into the bowl of popped amaranth and stir until it is evenly coated in chocolate.",
      "7. Transfer to the parchment-lined pan and refrigerate until set - about 1 hour. Then slice into bars - we like slicing into ~12 bars as they are rich and satisfying even as a small bar.",
      "8. Store in the refrigerator for up to 1-2 weeks or in the freezer for 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/12/Chocolate-Amaranth-Bars-SQUARE.jpg",
    "description": "Crispy, satisfying Dark Chocolate Amaranth Bars.",
    "serve": 12,
    "review": []
  },
  {
    "recipeName": "Orange Cardamom Energy Bites",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "15 mins",
    "cookTime": null,
    "nutrition": "76 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 cup (packed) pitted dates* ((measured after pitting // 11 medjool dates yield ~1 cup))",
      "1/2 cup raw unsalted cashews ((if nut-free, sub seed of choice, such as hemp or sunflower))",
      "1/2 cup desiccated or shredded unsweetened coconut",
      "1 pinch sea salt",
      "3/4 - 1 1/2 tsp ground cardamom ((depending on the freshness of your cardamom, and your personal preference))",
      "1/2 tsp (packed) orange zest*",
      "1 tsp (packed) orange zest",
      "3 Tbsp desiccated coconut",
      "1 Tbsp coconut sugar"
    ],
    "recipeInstructions": [
      "1. To a food processor add pitted dates, cashews, coconut, sea salt, cardamom, and orange zest. Note: If you don't have a food processor you can try using a blender, but dates can be tough for blenders due to their sticky nature, so use a low speed if possible and pulse rather than blending.",
      "2. Pulse until the mixture is broken down and crumbly - we like to stop before it becomes completely dough-like so that the bites maintain some texture. It should stick together when pressed between two fingers; if still dry and crumbly, continue processing until it is sticky enough to form into a ball. Taste and adjust as needed, adding more cardamom, orange zest, or salt to taste.",
      "3. If using the coconut coating, prepare that at this time. In a small bowl, combine the orange zest, desiccated coconut, and coconut sugar. Now it's time to roll the balls!",
      "4. Scoop out 1-Tbsp amounts and roll into balls. As the original recipe is written, ~16 balls. If using the coating, roll the balls in the coating until generously covered.",
      "5. Enjoy immediately or store leftovers covered in the refrigerator up to 1 week, or in the freezer up to 1 month. We enjoy these right out of the fridge or after sitting at room temperature for 5-10 minutes."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/11/Orange-Cardamom-Energy-Bites-SQUARE.jpg",
    "description": "Sweet, zesty, decadent energy bites infused with orange zest and cardamom.!",
    "serve": 16,
    "review": []
  },
  {
    "recipeName": "How to Make a Vegan 'Charcuterie' Board",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "30 mins",
    "cookTime": null,
    "nutrition": "433 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "Olives",
      "Olive Tapenade ((or store-bought))",
      "Salted roasted nuts ((cashews, pistachios, almonds, pecans))",
      "Quick Pickled Veggies ((or store-bought pickles or cornichons))",
      "Candied Nuts",
      "Orange Thyme Jam ((or store-bought))",
      "Dates",
      "Fresh fruit of choice ((strawberries, blackberries, green apple, peaches))",
      "Truffles",
      "Easy Garlic &amp; Herb Vegan Cheese ((we like Treeline for store-bought))",
      "Spicy Vegan Pimento Cheese Ball",
      "Hummus ((or store-bought))",
      "Crispy Baked Chickpeas ((or store-bought))",
      "Vegan Pepperoni",
      "Spicy Pickled Cauliflower",
      "Charred Serrano White Bean Dip",
      "1-Bowl Vegan Gluten-Free Crackers ((or store-bought))",
      "Bread of choice",
      "Fresh veggies of choice ((carrots, radishes, green beans/peas, cucumber))"
    ],
    "recipeInstructions": [
      "1. Start by making your selections from each section (salty, sweet, savory, spicy, and for dipping). We chose the following for our board pictured above: Salty: olives and cornichons; Sweet: candied nuts, dates, and fresh fruit; Savory: spicy vegan pimento cheese ball and Treeline's herb garlic soft cheese; Spicy: vegan pepperoni and charred serrano white bean dip; and For Dipping: Simple Mills almond flour crackers, Whole Foods gluten-free oat and seed crispbreads, rustic French bread, and fresh veggies!",
      "2. To make the homemade components of the charcuterie board pictured above, we started by making our spicy vegan pimento cheese ball in advance and letting it chill for the minimum time suggested in the recipe (6 hours). Next we made vegan pepperoni and set it aside when it was done. Then we made charred serrano white bean dip and placed it in the refrigerator to chill. Lastly we made candied nuts and cut up the fresh fruits and veggies!",
      "3. Once you've gathered and prepared your components, it's time to assemble! Grab a wooden tray or cutting board (or a parchment-lined baking sheet). You want it to be big enough to fit everything but small enough that your snacks look abundant, not sparse.",
      "4. Place your snacks on the board in order from largest to smallest. Start with any bowls or dishes for snacks (like olives and hummus) and space them out on the board so you can place smaller snacks in between. Then fill in the extra space with &quot;loose&quot; snacks, like veggies and crackers. Our favorite trick is to place stackable snacks (like cucumbers and vegan pepperoni) in curves or around the dishes. All that's left is to get your snack on!",
      "5. Best when fresh. Store leftover components in the refrigerator covered on the board or separately for up to 1-2 days."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/08/Vegan-Charcuterie-Board-SQUARE.jpg",
    "description": "A gorgeous vegan charcuterie board.",
    "serve": 8,
    "review": []
  },
  {
    "recipeName": "Easy Almond Brittle (4 Ingredients!)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "5 mins",
    "cookTime": "25 mins",
    "nutrition": "168 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 Tbsp coconut oil",
      "1/2 cup maple syrup",
      "2 Tbsp coconut sugar",
      "1 1/2 cups blanched slivered almonds ((or sub cashew halves, pumpkin seeds, sunflower seeds, or sesame seeds))",
      "1 healthy pinch sea salt  ((optional))"
    ],
    "recipeInstructions": [
      "1. Preheat oven to 325 degrees F (162 C) and line a baking sheet with parchment paper, ensuring it covers the entire surface and all the edges (to prevent spillover).",
      "2. To a small saucepan, add coconut oil, maple syrup, and coconut sugar. Warm over medium-low heat for 2-3 minutes, stirring occasionally, until there is no visible separation and the coconut sugar has dissolved.",
      "3. Remove the pan from the heat and stir in almonds and salt (optional) until evenly coated.",
      "4. Pour mixture onto the parchment-lined baking sheet and spread into an even layer with a metal or wooden spoon. Try to get it as even as possible, or the edges will burn and the center won't crisp up as it should (see photo).",
      "5. Bake for 15 minutes, then turn the pan around to ensure even browning. Bake 5-10 minutes more and watch carefully to prevent burning. You'll know it's done when it's uniformly golden brown in color and very fragrant. The edges may appear to be getting too brown, but they're just getting crisp and caramelized, so don't be afraid of that! If you don't bake it long enough, it will end up chewy instead of crunchy.",
      "6. Let cool completely before breaking into bite-size pieces with a sharp knife or by hand.",
      "7. Once completely cooled, store leftovers in a sealed bag or container at room temperature for 1 week or in the freezer for up to 1 month. This makes an excellent holiday dessert or gift!"
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/09/Easy-Almond-Brittle-SQUARE.jpg",
    "description": "Sweet and crunchy almond brittle perfect for the holidays and beyond.",
    "serve": 10,
    "review": []
  },
  {
    "recipeName": "Easy Apple Coffee Cake (GF, Vegan)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "20 mins",
    "cookTime": "40 mins",
    "nutrition": "323 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "3/4 cup unsweetened dairy-free milk ((we used almond))",
      "1/2 cup vegan butter, melted ((we like Miyoko's here))",
      "1/4 cup maple syrup",
      "1 tsp vanilla extract",
      "1/2 cup coconut sugar ((or sub organic cane sugar))",
      "2 1/2 cups almond flour",
      "1 1/2 cups DIY Gluten-Free Flour Blend ((see notes for store-bought))",
      "1 1/2 tsp baking powder",
      "1 1/2 tsp baking soda",
      "1/2 tsp cinnamon",
      "1/4 tsp sea salt",
      "1 1/2 cups chopped Granny Smith apples, peeled and cut into 1/2-inch cubes",
      "1/4 cup organic cane sugar",
      "1/4 cup coconut sugar ((or sub brown sugar))",
      "1/2 tsp cinnamon",
      "1/4 cup vegan butter, melted ((we like Miyoko's here))",
      "1/2 - 3/4 cup DIY Gluten-Free Flour Blend ((see notes for store-bought))"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 375 F (190 C) and line an 8x8-inch baking dish with parchment paper, leaving plenty of paper over the edges so you can easily lift the cake out later. This recipe will also work in a 9-inch round cake pan, or two 6-inch round cake pans.",
      "2. In a large mixing bowl, combine dairy-free milk, melted butter, maple syrup, and vanilla and mix well. Next, add the coconut sugar, almond flour, gluten-free flour blend, baking powder, baking soda, cinnamon, and salt and stir until well combined. The texture will be quite thick and will resemble a cookie dough more than a typical cake batter. Add the cubed apples and mix until they are evenly distributed throughout the batter.",
      "3. Scrape the batter into the prepared baking dish and spread it evenly. It's okay if the top has some texture; it will be covered with the crumble topping later!",
      "4. Put the cake into the oven and bake for 40 minutes. Meanwhile, prepare the crumble topping (optional).",
      "5. To your now-empty mixing bowl, add the cane sugar, coconut sugar, and cinnamon and mix with a fork until evenly combined. Add the vegan butter and mix well. Next, begin adding the flour in 1/4 cup (40 g) increments, mixing well with your fork after each addition. You may need more or less flour depending on the brand of your gluten-free blend. Add flour until the texture appears pale and slightly dry and the mixture clumps together easily when you pinch it.",
      "6. At the 40-minute mark, remove the cake from the oven and carefully add the crumble topping in an even layer on top of the cake. Return the cake to the oven for 5 minutes until the crumble topping is dry to the touch and just beginning to look toasty.",
      "7. Remove from the oven and let cool for at least 10 minutes before removing from the baking dish. Let cool almost completely before slicing and serving. Keep at room temperature for up to 3 days or in the freezer for up to 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/08/Apple-Crumb-Cake-SQUARE.jpg",
    "description": "Perfectly balanced, slightly toasty, classic apple coffee cake.",
    "serve": 12,
    "review": []
  },
  {
    "recipeName": "Pumpkin Spice Cake Bites",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "10 mins",
    "cookTime": null,
    "nutrition": "151 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 1/2 cups pitted dates",
      "1 1/2 cups walnuts",
      "3/4 cup rolled oats",
      "1/2 cup almond flour",
      "1 ¾ tsp cinnamon",
      "3/4 tsp nutmeg",
      "1/2 tsp ginger",
      "1/2 tsp allspice ((optional))",
      "1/4 tsp sea salt",
      "1 1/2 tsp vanilla extract",
      "2 Tbsp pumpkin purée",
      "3 Tbsp coconut butter",
      "2 tsp orange zest ((about 1/2 an orange, zested))"
    ],
    "recipeInstructions": [
      "1. BITES: Place the dates in a food processor and process until mostly smooth or a ball forms. Scrape the sides as needed. Remove the date paste from the food processor and set aside.",
      "2. Next, add the walnuts, oats, almond flour, cinnamon, nutmeg, ginger, allspice (optional), and salt. Pulse until very fine crumbs appear. Add the vanilla and pumpkin purée. Add a spoonful of date paste at a time pulsing to incorporate. Repeat until all of the date paste is used.  Taste and adjust the level of spice to your preference, adding more vanilla for cakey flavor, more cinnamon for warmth, or more ginger for spice!",
      "3. Scoop out 1 1/2 Tbsp amounts (we love this scoop) and roll into balls. Repeat until all of the dough is used. For best texture, we recommend placing the bites on a parchment-lined baking sheet or plate and placing in the refrigerator to chill for at least 30 minutes (or 15 in the freezer).",
      "4. GLAZE: If using the optional glaze, prepare it once the bites have chilled. Add 1 inch of water to a small saucepan and bring to a low boil over medium heat. Once boiling, reduce heat to low and place the coconut butter in a small heat-proof bowl (we prefer glass). Carefully place the bowl on top of the saucepan of simmering water. Heat, stirring occasionally with a spatula or spoon, until melted and loose (~2 minutes). You can also melt the glaze in a heat-proof bowl in the microwave in 20-second increments until melted.",
      "5. Using a small spoon, carefully place some melted coconut butter on top of each of the bites, letting it run down the sides slightly. Alternatively, dunk each bite into the glaze and roll around until all sides are coated. Use a fork to tap off excess glaze, then transfer back to your parchment-lined plate or baking sheet. While the glaze is still tacky, sprinkle orange zest evenly over all the bites.",
      "6. Enjoy right away or whenever you need a quick snack! Store in the refrigerator for up to 1 week or in the freezer for up to 1 month. Note that the coconut glaze can get soft at warm temperatures."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/08/Pumpkin-Spice-Cake-Bites-SQUARE.jpg",
    "description": "Classic pumpkin spice flavors in decadent and dreamy energy bite form.",
    "serve": 16,
    "review": []
  },
  {
    "recipeName": "Apple Pie Overnight Oats",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "375 mins",
    "cookTime": "15 mins",
    "nutrition": "247 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "3/4 cup crisp, sweet apple, cut into small bite-size pieces",
      "3/4 tsp ground cinnamon",
      "1 Tbsp maple syrup",
      "1 pinch sea salt",
      "3/4 cup unsweetened plain almond milk",
      "1 Tbsp chia seeds",
      "1/2 - 1 Tbsp maple syrup",
      "1/2 tsp ground cinnamon",
      "2 Tbsp creamy unsalted cashew or almond butter",
      "1 tsp vanilla extract",
      "1/2 cup rolled oats"
    ],
    "recipeInstructions": [
      "1. APPLES: To a small saucepan, add chopped apples, cinnamon, maple syrup, and salt and mix to evenly distribute the cinnamon.",
      "2. Turn heat on low and cover. Cook, stirring occasionally, for about 10 minutes or until the apples are soft and tender. Remove the lid, turn the heat up to medium, and cook for 2-3 more minutes, stirring constantly, to evaporate some of the juices and create a nice syrup around the apples. Once most of the liquid is gone, turn off the heat and set aside.",
      "3. OATS: In a small bowl or liquid measuring cup, mix the almond milk, chia seeds, maple syrup, cinnamon, nut butter, and vanilla. Add the oats and stir until well-combined.",
      "4. Get two small mason jars or small bowls with lids. Place about a quarter of the cooked apple mixture into the bottom of each container, add half the oat mixture to each as your middle layer, then divide and place the rest of the cooked apples on top of the oats. Place in the refrigerator overnight, or for at least 6 hours.",
      "5. Enjoy chilled or at room temperature. Overnight oats will keep in the refrigerator for 2-3 days, though best within the first 12-24 hours in our experience. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Apple-Pie-Overnight-Oats-SQUARE.jpg",
    "description": "Easy overnight oats infused with the flavors of apple pie.",
    "serve": 2,
    "review": []
  },
  {
    "recipeName": "Easy Peach Scones (Gluten-Free, Vegan)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "15 mins",
    "cookTime": "20 mins",
    "nutrition": "293 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 1/2 tsp flaxseed meal",
      "1 1/2 Tbsp water",
      "1/4 cup unsweetened dairy-free milk ((we used almond milk))",
      "1 tsp vanilla extract ((optional))",
      "1 1/4 cup almond flour ((if nut-free, see notes))",
      "3/4 cup potato starch* ((not potato flour))",
      "1/2 cup oat flour ((certified gluten-free as needed // if oat-free, see notes))",
      "2 1/2 tsp baking powder",
      "3 Tbsp organic cane sugar ((or sub coconut sugar, but they won't be as crisp and will be more brown in color))",
      "1/4 tsp sea salt",
      "3 Tbsp cold vegan butter ((we used Miyoko's // or sub room temperature coconut oil - needs to be scoopable, not liquid or frozen*))",
      "3/4 cup diced peaches ((fresh is best // if using frozen or canned, thaw and drain liquid))",
      "1 cup sifted organic powdered sugar",
      "1/2 tsp vanilla extract",
      "1-2 Tbsp dairy-free milk"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 400 degrees F (200 C) and line a baking sheet with parchment paper. Set aside.",
      "2. SCONES: In a small bowl, prepare the flax egg by combining flaxseed meal and water. Stir and let sit for a few minutes to gel. Then add the dairy-free milk and vanilla (optional).",
      "3. In a separate, larger mixing bowl, add almond flour, potato starch, oat flour, baking powder, cane sugar, and salt.",
      "4. Cut the cold vegan butter into cubes and add it to the dry ingredients. Using a fork or pastry cutter, cut the butter into the dry ingredients until only small bits remain.",
      "5. Whisk the dairy-free milk and flax mixture one more time and add to the dry ingredients, stirring with a wooden spoon until combined.",
      "6. Next, add the diced peaches and gently stir until evenly distributed. The moisture from the peaches will bind the dough more. Using extra ripe peaches may make it more moist, while using firmer, less-ripe peaches may make it more dry. You want the dough to be evenly moist but not overly sticky. If your dough is too crumbly, add a tablespoon more dairy-free milk at a time. If it's too wet/sticky, add more almond flour a tablespoon at a time.",
      "7. Gently transfer dough to an oat or almond floured surface. Shape into a disk about 3/4 to 1 inch in height. Cut the circle into 6 wedges (or 8 for smaller scones) and gently place them onto the baking sheet, spacing them out evenly. Option to sprinkle with a bit more organic cane sugar for a bit of a sweet crust.",
      "8. Bake for 18-22 minutes until fluffy and golden on the edges. Let cool on the baking sheet before digging in.",
      "9. VANILLA GLAZE: For the optional glaze, combine sifted organic powdered sugar, vanilla extract, and dairy-free milk of choice in a mixing bowl and whisk into a pourable glaze. If too thick, add more dairy-free milk. If too thin, add more powdered sugar. Drizzle over scones once cooled. Glaze will set in 30 minutes to 1 hour.",
      "10. Enjoy as is or serve with vegan butter and a cup of tea. These are best the day of but can be reheated the next day in a toaster oven or regular oven at 350 F for a few minutes (or enjoy at room temperature). Once completely cooled, store leftovers at room temperature in a well-sealed container for up to 3 days, or in the freezer for up to 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Gluten-Free-Peach-Scones-SQUARE.jpg",
    "description": "Flaky, buttery gluten-free scones studded with ripe summer peaches.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Perfect Roasted Eggplant (Tender, Caramelized!)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "5 mins",
    "cookTime": "25 mins",
    "nutrition": "85 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 medium eggplant, ends trimmed, cut into 1/2- to 1-inch cubes  ((1 medium eggplant yields ~4 cups cubed or 400g))",
      "2 Tbsp olive oil",
      "1/2 tsp sea salt"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 425 F (218 C) and line a baking sheet with parchment paper.",
      "2. Add cubed eggplant to the parchment-lined baking sheet. Drizzle evenly with olive oil and, working quickly, toss to evenly distribute the oil. Sprinkle evenly with the salt and toss once more. Roast on the center rack for 25-30 minutes or until tender with a lightly browned exterior, tossing around the 15-minute mark.",
      "3. Serve as a side or snack, in bowls, wraps, or pasta, or on salads.",
      "4. Best when fresh. Leftovers will keep in a sealed container in the refrigerator for 1-2 days. Reheat in a cast iron skillet until warm. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Perfect-Roasted-Eggplant-SQUARE.jpg",
    "description": "An easy, step-by-step recipe for oven-roasted eggplant! It's tender, caramelized, versatile, and perfect every time! Just 3 ingredients and 30 minutes required.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Peaches and Cream Overnight Oats",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "365 mins",
    "cookTime": null,
    "nutrition": "445 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "3/4 cup plain unsweetened dairy-free milk ((almond, cashew, or boxed coconut))",
      "1/2 tsp vanilla extract",
      "1 Tbsp almond or cashew butter",
      "1-1 1/2 Tbsp maple syrup",
      "1 dash sea salt",
      "1 Tbsp chia seeds",
      "1/2 cup rolled oats ((gluten-free certified as needed))",
      "1/4 cup diced peaches ((ripe and juicy // thaw if frozen))",
      "2 Tbsp coconut yogurt ((we used plain Culina // any thick yogurt will do))",
      "Extra peaches",
      "Granola",
      "Chopped almonds",
      "Coconut sugar",
      "Freeze-dried peaches"
    ],
    "recipeInstructions": [
      "1. To a jar (wide-mouth is best) or small bowl with a lid, add dairy-free milk, vanilla, nut butter, maple syrup, salt, and chia seeds. Stir to combine. Leaving some bigger blobs of nut butter will add a nice textural component.",
      "2. Add oats and diced peaches. Stir well, slightly mashing the peaches. Dollop the coconut yogurt on top and swirl into the oats. Leave some big clumps - again, they're delicious the next day! Secure with a lid and place in the fridge for at least 6 hours or overnight.",
      "3. The next day, add your preferred toppings (we like more peaches, granola, chopped almonds, coconut sugar, and/or freeze-dried peaches). Enjoy!",
      "4. OPTIONAL: If you prefer warm oats, you can heat your oats in the microwave for 45-60 seconds (just ensure there's enough room at the top of your jar to allow for expansion and prevent overflow, and that it's a microwave-safe container), or transfer oats to a saucepan and heat over medium heat until warmed through. Add more liquid as needed if oats get too thick/dry.",
      "5. Overnight oats will keep in the refrigerator for 2-3 days, though best within the first 12-24 hours. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Peaches-n-Cream-Overnight-Oats-SQUARE.jpg",
    "description": "The ultimate plant-based, gluten-free breakfast or snack.",
    "serve": 1,
    "review": []
  },
  {
    "recipeName": "Crispy Baked Jackfruit Taquitos (Vegan, GF)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "30 mins",
    "cookTime": "45 mins",
    "nutrition": "99 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 (20-ounce) cans jackfruit in water or brine ((NOT in syrup // we like Trader Joe's brand))",
      "2 Tbsp avocado or coconut oil ((if avoiding oil, sub water))",
      "1/2 large white or yellow onion ((thinly sliced))",
      "4 cloves garlic, minced ((optional))",
      "1/2 tsp sea salt",
      "1 Tbsp ground smoked paprika",
      "1 Tbsp ground cumin",
      "1 Tbsp chili powder",
      "2-3 Tbsp coconut sugar ((or maple syrup or organic brown sugar))",
      "1-2 small chipotle peppers in adobo sauce ((from a can* // roughly chopped))",
      "3 tsp adobo sauce ((use more or less to achieve preferred spice level))",
      "3-4 Tbsp coconut aminos",
      "2/3 cup water ((plus more as needed))",
      "2 Tbsp lime juice ((optional as some tanginess comes from the jackfruit brine))",
      "16 corn tortillas",
      "Avocado oil ((for greasing pan and brushing taquitos))",
      "Refried beans",
      "Guacamole",
      "Vegan sour cream",
      "Salsa verde"
    ],
    "recipeInstructions": [
      "1. Thoroughly rinse and drain jackfruit. Then begin sorting. The pieces come in chunks or triangle shapes. Cut off the center 'core' portion of the jackfruit that's tougher in texture and separate it from the rest of the fruit. Then chop into smaller pieces. For the remaining portion of the jackfruit that appears more stringy, use your hands or a fork to pull into small shredded pieces. You're basically trying to get the jackfruit into small, shredded/chopped pieces. Rinse the jackfruit once more in a fine mesh strainer, drain, and thoroughly dry.",
      "2. Heat a large skillet over medium heat. Once hot, add oil of choice, onion, and garlic (optional). Sauté for 4-5 minutes or until onions are golden brown and softened.",
      "3. Add jackfruit, salt, paprika, cumin, chili powder, coconut sugar, chipotle peppers and their adobo sauce, coconut aminos, water, and lime juice (optional). Stir to coat and reduce heat to low-medium. Cover and cook for about 10 minutes, stirring occasionally.",
      "4. Taste and adjust flavors as needed, adding more paprika or cumin for smokiness, chili powder for heat, chipotle pepper or adobo sauce for spice, coconut sugar or maple syrup for sweetness, coconut aminos for saltiness / depth of flavor, or lime for acidity.",
      "5. Turn up heat to medium-high and cook for 3-5 minutes more to get a little extra color/texture. Then remove from heat.",
      "6. Preheat the oven to 425 F (218 C) and brush a baking sheet with avocado oil. Set aside.",
      "7. Next, working in batches (~8 tortillas at a time), warm your tortillas by wrapping them in a damp kitchen towel or paper towel and microwaving for ~30-60 seconds. This ensures they are nice and pliable to prevent them from splitting open or unfolding.",
      "8. Fill the tortillas one at a time, using ~2 heaping tablespoons of the jackfruit mixture. They hold their shape best if you place the filling closer to one side and in a narrow pile (see photo). Roll gently but tightly into taquitos and place them seam side down on the prepared baking sheet. Repeat until all the filling is used. It should make ~16 taquitos.",
      "9. Spray or brush the taquitos generously with avocado oil (or another neutral oil) and bake for 15-20 minutes, or until crispy and uniformly golden brown. Watch carefully near the end to avoid burning. The undersides get more browned than the tops.",
      "10. Serve warm on their own or with refried beans, guacamole, vegan sour cream, and/or salsa verde. Leftovers will keep stored in the freezer up to 1 month.",
      "11. TO FREEZE: Let cool completely, then transfer to a freezer-safe container. Reheat by covering with a lid or paper towel and microwaving for 1-2 minutes, or until heated through to the center."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/06/Crispy-Jackfruit-Taquitos-SQUARE.jpg",
    "description": "Unbelievably crispy and delicious vegan taquitos filled with a savory, smoky jackfruit filling! Perfect for making ahead and storing in the freezer for a quick snack! Just 10 ingredients required.",
    "serve": 16,
    "review": []
  },
  {
    "recipeName": "Crispy BBQ Roasted Chickpeas",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "15 mins",
    "cookTime": "45 mins",
    "nutrition": "122 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 (15-ounce) can chickpeas",
      "1 Tbsp avocado or other neutral oil ((if avoiding oil, omit and don't rinse chickpeas - just drain))",
      "2 tsp maple syrup",
      "1 1/2 tsp smoked paprika",
      "1 tsp chili powder",
      "3/4 tsp garlic powder",
      "1/4 tsp sea salt",
      "1/4 tsp black pepper",
      "1/4 tsp cayenne pepper"
    ],
    "recipeInstructions": [
      "1. Preheat oven to 350 degrees F (176 C) and set out a bare (or parchment-lined) baking sheet (or more as needed).",
      "2. Drain chickpeas well. If using oil, rinse well with water and thoroughly drain. If omitting oil, simply drain well and skip rinsing with water.",
      "3. Once drained well, spread the chickpeas out on a clean, absorbent towel and use your hands to gently roll and dry the chickpeas. Some of the skins should start coming off. You can opt to peel all of the chickpeas - which can help for extra crispiness! - or simply remove the skins that come off. Either way, the chickpeas will crisp up. I just found that peeling them does yield slightly crispier chickpeas.",
      "4. Transfer the chickpeas to a mixing bowl and top with oil. Mix well to combine. DO NOT add the other seasonings at this point - they can interrupt the crisping process, so wait to add until after baking.",
      "5. Bake for 45 minutes or until golden brown and dry/crispy to the touch. We like turning the pan around and shaking the chickpeas around the halfway point for even cooking. Note: Peeled chickpeas cook faster than unpeeled. If omitting oil, they will also cook faster.",
      "6. Remove your chickpeas from the oven and prepare your BBQ seasoning. In a medium-size mixing bowl, combine the maple syrup, smoked paprika, chili powder, garlic powder, sea salt, black pepper, and cayenne (optional) until a paste forms.",
      "7. Pour in your still-warm chickpeas and toss gently to evenly coat them with the seasoning mixture. Place them back on the cookie sheet to cool fully and so the seasoning can dry/set.",
      "8. Enjoy as a protein-rich snack or use atop things like grain bowls, kale salads, or our easy and summery chopped salad! To store, place in a storage container or jar and DO NOT tightly cover. Instead, crack lid so they can 'breathe' a bit. This helps them stay crispy longer. These are best the first day, but they will last for 4-5 days at room temperature. Alternatively, seal well and freeze up to 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/05/Crispy-BBQ-Chickpeas-SQUARE.jpg",
    "description": "Crispy roasted chickpeas tossed in smoky BBQ spices.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Almond Joy Energy Bites (6 Ingredients!)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "60 mins",
    "cookTime": null,
    "nutrition": "168 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "12 whole roasted almonds",
      "15 medjool dates, pitted",
      "1 1/2 cups unsweetened coconut flakes",
      "1/2 cup almond butter",
      "1/2 cup cacao powder ((or cocoa powder))",
      "2 tsp vanilla extract",
      "1/4 tsp sea salt",
      "1/3 cup coconut butter",
      "2 tsp coconut oil"
    ],
    "recipeInstructions": [
      "1. ROASTING ALMONDS: If topping your bites with almonds (optional), preheat the oven to 350 F (176 C) and place raw almonds on a small baking sheet. Place almonds in the preheated oven and bake for 8 minutes (be careful not to burn). Set aside for later use.",
      "2. BITES: To a food processor, add pitted dates and coconut flakes and pulse until well combined and only small chunks of date remain - about 1 minute.",
      "3. Add in the almond butter, cacao powder, vanilla extract, and salt. Pulse until everything is evenly combined. The mixture should be wet enough to stick together when you squeeze it but dry enough not to stick to your hands too much. If too dry, add more almond butter 1 Tbsp at a time. If too sticky, add more coconut flakes 1 Tbsp at a time.",
      "4. Scoop out 2-Tbsp amounts and use your hands to roll into balls. As original recipe is written, makes ~12 balls. Place balls on a parchment-lined plate or baking sheet and transfer to the freezer for 20 minutes, or until semi-firm to the touch.",
      "5. GLAZE: If using the optional glaze, prepare it while the bites chill. Add 1 inch of water to a small saucepan and bring to a low boil over medium heat. Once boiling, reduce heat to low and place the coconut butter and coconut oil in a small heat-proof bowl (we prefer glass). Carefully place the bowl on top of the saucepan with simmering water. Heat, stirring occasionally with a spatula or spoon, until melted and loose (~2 minutes). You can also melt the glaze in a heat-proof bowl in the microwave in 20-second increments until melted.",
      "6. Remove bites from the freezer. Dunk each bite into the glaze and roll around until all sides are coated. Use a fork to tap off excess glaze, then transfer back to your parchment-lined plate or baking sheet. To reduce pooling, you can place glazed bites on a cooling rack set over the parchment-lined dish.",
      "7. If there's any leftover glaze, either chill once more then coat again, or pour extra glaze into a silicone mold or cupcake liner, chill, and enjoy as a treat.",
      "8. Once all balls are glazed, option to place a roasted almond on each ball while the glaze is still wet. Leave them to set at room temperature or place in the refrigerator for at least 10 minutes to harden faster.",
      "9. Enjoy right away or whenever you need a quick snack! Store in the refrigerator for up to 1 week or in the freezer for up to 1 month. Note that the coconut glaze can get soft at warm temperatures."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/05/Almond-Joy-Energy-Bites-SQUARE.jpg",
    "description": "Delicious energy bites infused with chocolate, coconut, and almonds.",
    "serve": 15,
    "review": []
  },
  {
    "recipeName": "Kale & Sweet Potato Fritters",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "15 mins",
    "cookTime": "15 mins",
    "nutrition": "99 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 cups peeled, grated sweet potato ((~1 medium sweet potato))",
      "1 1/2 Tbsp avocado oil ((plus more for cooking fritters))",
      "1 cup diced red onion ((~1/2 large onion))",
      "2 cups shredded kale ((cut very small or shredded in a food processor))",
      "1/2 tsp sea salt, to taste",
      "1 1/4 tsp garam masala",
      "1/4 cup white rice flour",
      "Mint chutney"
    ],
    "recipeInstructions": [
      "1. Shred sweet potato using either the coarse side of a box grater or the grater attachment of a food processor.",
      "2. Heat a large rimmed skillet (we prefer cast iron) over medium heat. Once hot, add oil, onion, grated sweet potato, and kale. Sauté for 4-5 minutes, stirring frequently, or until the onion and sweet potato are tender and fragrant. Set aside.",
      "3. To a large mixing bowl add sautéed vegetables, salt, and garam masala and stir. Then add rice flour and stir until combined. You should have a slightly tacky but moldable mixture. Add more rice flour as needed if too wet to handle.",
      "4. Form into thin (roughly 1/4-inch-thick) patties the size of the palm of your hand (we used ~1/4 cup of sweet potato mixture per patty). In the meantime, wipe down and heat the large rimmed skillet you used to sauté your vegetables, or another one (we prefer cast iron or non-stick).",
      "5. Once hot, add a little avocado oil to lightly coat the bottom of the pan (we used ~1/2 Tbsp // use more for a crispier effect). Add enough fritters to comfortably fit without crowding. Pan fry until golden brown - ~3-4 minutes on each side.",
      "6. Optional: For even crispier fritters, continue baking in a 400 degree F (204 C) oven for 10-15 minutes.",
      "7. Serve hot topped with mint chutney (optional). Best when fresh. Store leftovers covered in the refrigerator up to 3-4 days, or in the freezer up to 1 month. Reheat on the stovetop over medium heat, in a 350 degree F (176 C) oven, or in the microwave until hot. If frozen, thaw slightly before reheating."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/04/Kale-and-Sweet-Potato-Fritters-SQUARE.jpg",
    "description": "Super flavorful sweet potato fritters with kale, onion, and garam masala. Plant-based, gluten-free, and SO delicious! Just 7 ingredients, 1 bowl, and 30 minutes required!",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Crispy Gluten-Free Graham Crackers (Vegan)",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "30 mins",
    "cookTime": "15 mins",
    "nutrition": "78 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 Tbsp coconut sugar ((or sub organic cane sugar))",
      "1/2 tsp baking soda",
      "1/4 tsp sea salt",
      "1/4 tsp ground cinnamon",
      "1/4 cup maple syrup",
      "1 Tbsp molasses ((we used blackstrap molasses))",
      "2 1/2 Tbsp melted coconut oil",
      "1 1/4 cup oat flour ((ground from gluten-free oats // see notes for substitution ideas))",
      "1/4 cup arrowroot starch ((we think cornstarch would also work, and maybe also tapioca starch))",
      "1 1/2 tsp ground flax seeds ((also called flaxseed meal))"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 350 F (176 C) and line a large baking sheet with parchment paper.",
      "2. In a medium mixing bowl, whisk together the coconut sugar, baking soda, salt, cinnamon, maple syrup, molasses, and melted coconut oil until well combined and smooth.",
      "3. Add in the oat flour, arrowroot starch, and ground flax seeds and mix with a wooden spoon until the flour is completely incorporated. Your dough should not feel too tacky (sticking to your hands) or too dry (crumbly), but should hold its form. If the dough appears too dry, it likely just needs more mixing. If it feels sticky, it needs more oat flour.",
      "4. Place a sheet of parchment paper on a large cutting board or countertop. Place dough in the center and then place another sheet of parchment paper on top of the dough. Working from the center out, roll the dough into a large rectangle (~10 x 12 inches) about 1/16-inch thick. Rolling to this thickness makes these crackers crispy (our preferred texture) rather than soft. If you have any difficulty rolling the dough, place it in the fridge to chill for 10-20 minutes and then try again.",
      "5. Use a pizza cutter or knife to cut the dough into 2-inch x 3-inch rectangles (keep in mind they will expand slightly during baking). Then use a metal spatula lightly floured with oat flour to transfer to a baking sheet. If you have a hard time transferring or handling, pop in the refrigerator to chill for 5-10 minutes. Space crackers ~1 inch apart to allow for spreading.",
      "6. Continue rolling out and cutting remaining dough until you have used it all up. Prick each graham cracker twice with a fork. Recipe as written makes ~15 crackers (will vary based on how thinly they are rolled and whether modifying batch size).",
      "7. Bake for 10-14 minutes or until slightly firm and darker in color. Watch closely near the end to avoid burning.",
      "8. Let cool for 5-10 minutes on the baking sheet, then gently transfer to a cooling rack. Enjoy plain, make s'mores, or try our graham cracker crust!",
      "9. Once completely cooled, crackers can be stored in an airtight container for up to 2-3 days at room temperature, 7-10 days in the fridge, or 1-2 months in the freezer. Dough can also be frozen for up to 1 month and rolled/baked after defrosting in the fridge overnight."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/03/V-GF-Graham-Crackers-SQUARE.jpg",
    "description": "Crispy, gluten-free graham crackers that taste just like the real thing.",
    "serve": 15,
    "review": []
  },
  {
    "recipeName": "Gluten-Free Flatbread",
    "author": "Minimalist Baker",
    "type": "Snack",
    "prepTime": "10 mins",
    "cookTime": "10 mins",
    "nutrition": "194 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 cup light coconut milk (canned), plus more as needed",
      "1 Tbsp olive oil ((if oil-free, omit or try subbing tahini))",
      "1 tsp apple cider vinegar",
      "2 tsp baking powder",
      "1/2 heaping tsp sea salt",
      "3/4 tsp garlic powder",
      "3/4 tsp dried oregano",
      "1/2 cup coconut flour*",
      "3/4 cup oat flour* ((ground from gluten-free oats))",
      "3/4 cup potato starch ((NOT flour // potato starch is pretty key here for fluffy texture, so we recommend against subbing it out))",
      "1/4 cup gluten-free all-purpose flour"
    ],
    "recipeInstructions": [
      "1. In a medium mixing bowl add light coconut milk, olive oil, and apple cider vinegar and whisk to combine.",
      "2. Add baking powder, sea salt, garlic powder, and dried oregano and whisk to combine. The mixture will likely fluff up and foam from the reaction of the baking powder and apple cider vinegar. This is normal and good!",
      "3. Next, add coconut flour, oat flour, and potato starch and stir with a wooden spoon to combine. Let rest 5 minutes uncovered.",
      "4. At this point you should have a dough that is malleable and very slightly tacky but doesn't stick to your hands. The dough should start pulling away from the sides of the bowl when the right amount of moisture is achieved, and it shouldn't be crumbly at all. Add a bit more of each flour until you reach the right consistency.",
      "5. Scoop out 1 ball of dough (~3 Tbsp in size) and place between two pieces of parchment paper. Use a rolling pin to roll into a thin oval shape slightly larger than 1/8-inch thick. For fluffier, thicker flatbread roll to slightly less than 1/4-inch thick and cook slightly longer. NOTE: If sticking or too tacky, add a light dusting of GF flour to the dough while rolling out (optional - shouldn&#039;t be necessary).",
      "6. Heat a skillet (cast iron is best, or non-stick) over medium/medium-high heat. Once hot, spray or drizzle with a little oil. Then use hands to carefully transfer the dough to the pan. If it cracks at all, just carefully and quickly patch back together with your hands (be careful not to touch the hot skillet).",
      "7. Cook for 2-3 minutes or until the underside is golden brown. Bubbles may form while it's cooking - that's normal and good. Flip carefully and cook for another 2-3 minutes. Lower heat as needed to ensure it doesn't burn. You'll know it's done when both sides are golden brown.",
      "8. Repeat this process until all dough is used (~6 large or 10-12 mini flatbreads as the original recipe is written).",
      "9. Store leftovers covered in the refrigerator or at room temperature for up to 2-3 days. To freeze, place cooked, cooled flatbread in a freezer-safe container or bag (adding parchment paper between each flatbread will prevent sticking) and freeze for up to 1 month. As with most bread, best when fresh.",
      "10. To serve, either heat from frozen in a toaster oven, thaw overnight and then heat in a skillet, or microwave from frozen until warm."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/02/Gluten-Free-FlatBread-SQUARE.jpg",
    "description": "Light, fluffy, and flavorful gluten-free flatbread.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Creamy Vegan Mushroom Stroganoff (GF Optional)",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "20 mins",
    "cookTime": "40 mins",
    "nutrition": "411 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "1/2 cup raw cashews*",
      "1 cup water",
      "8 ounces cremini mushrooms ((~1 1/2 cups thinly sliced + 1 cup finely chopped))",
      "1 Tbsp vegan butter ((or sub olive oil))",
      "1 cup diced white or yellow onion ((1/2 large onion yields ~1 cup or 160 g))",
      "1/2 tsp sea salt",
      "1/4 tsp black pepper  ((optional))",
      "2 large cloves garlic, minced",
      "1 Tbsp freshly chopped thyme ((or 1 tsp dried thyme))",
      "1 Tbsp cornstarch ((or sub all-purpose flour, gluten-free if needed))",
      "1 1/2 tsp Dijon mustard",
      "1 1/2 cups cashew cream ((from above)*)",
      "Water ((for boiling))",
      "6 oz. dry noodles ((such as bowtie or farfalle // or tagliatelle if not egg-free/vegan // gluten-free as needed))",
      "Salt ((for seasoning water))",
      "Finely chopped chives",
      "Vegan sour cream"
    ],
    "recipeInstructions": [
      "1. Add 1/2 cup cashews (60 g // adjust amount if altering number of servings) to a bowl and cover with warm water by at least 2 inches. Set aside to soak.",
      "2. Clean the mushrooms by wiping them with a clean, damp kitchen towel. Thinly slice 1 1/2 cups (105 g) of the mushrooms and add the remainder to a food processor with the 'S' blade. Pulse to finely chop into small pieces. If you do not have a food processor, you can finely chop with a knife. Set aside.",
      "3. NOODLES: Add 3 quarts (~3 liters) of water and 1 Tbsp salt to a large pot (adjust amounts if adjusting serving size). Bring to a boil. Once boiling, add pasta, stir, and set a timer for the lower end of your package's recommendation.",
      "4. Meanwhile, drain the cashews and add them to a small blender with 1 cup (240 ml) water (adjust amount if altering batch size). Blend until smooth to make cashew cream. Set aside.",
      "5. Test pasta for doneness. When it's ready, reserve 1/2 cup (120 ml) pasta water for thinning the sauce. Then drain the pasta and set aside.",
      "6. STROGANOFF: Melt the vegan butter in a Dutch oven or large cast iron skillet over medium heat. Once melted, add the onion and season with a healthy pinch of salt and pepper (optional). Cook for 3-4 minutes or until translucent. Add the sliced mushrooms ONLY (not the finely chopped) and cook for 8-10 minutes, stirring occasionally, until they have released most of their moisture and begin to brown.",
      "7. Add the remaining (finely chopped) mushrooms and cook for 5-7 minutes. Add the garlic and thyme and sauté until fragrant - about 1-2 minutes. Add the cornstarch (or flour), salt, pepper (optional), and mustard and stir to coat the vegetables in the cornstarch (or flour).",
      "8. Add the cashew cream and bring to a simmer. Cook until thickened but still saucy, stirring frequently, over medium-low heat. If you want it saucier, you can stir in the 1/4 - 1/2 cup (120 ml) reserved pasta water. Or, if you forgot to reserve pasta water, you can also use filtered or tap water if needed. Serve over noodles or add the noodles to the sauce and stir to combine.",
      "9. Serve warm and optionally garnish with chives and vegan sour cream or yogurt. Leftovers will keep stored separately for 2-3 days. Sauce can be stored in the freezer for up to 1 month. Reheat leftovers in a saucepan until warm, adding water as needed to thin."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/09/Vegan-Mushroom-Stroganoff-SQUARE.jpg",
    "description": "The perfect mushroomy comfort food.",
    "serve": 3,
    "review": []
  },
  {
    "recipeName": "Miso Pumpkin Risotto with Crispy Sage",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "20 mins",
    "cookTime": "30 mins",
    "nutrition": "321 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "4 cups water",
      "2 Tbsp chickpea miso paste",
      "1 (15-oz.) can pumpkin purée",
      "2 Tbsp olive oil ((or vegan butter))",
      "1 cup thinly sliced leeks ((well cleaned and dried))",
      "6 cloves garlic, minced",
      "1 Tbsp freshly chopped sage",
      "1 cup arborio rice",
      "3/4 tsp sea salt",
      "1/4 cup dry white wine ((such as sauvignon blanc or pinot gris))",
      "1-2 tsp maple syrup  ((optional // for enhanced pumpkin flavor))",
      "1 1/2 - 2 Tbsp olive oil",
      "1/4 cup chopped fresh sage",
      "1 healthy pinch sea salt"
    ],
    "recipeInstructions": [
      "1. MISO PUMPKIN BROTH: In a medium saucepan, bring water to a simmer over medium heat. Once simmering, reduce heat to low to keep the water warm.",
      "2. Add miso to a small mixing bowl and scoop out ~1/2 cup (120 ml) of water from the saucepan. Add to the miso and whisk/stir until mostly dissolved (this allows the miso to fully blend with the water and not clump). Add the miso mixture and pumpkin purée to the pot of warm water and stir to dissolve. Turn off the heat, but leave the pot on the stovetop to keep warm.",
      "3. RISOTTO: Heat a large rimmed skillet over medium-high heat. Add the olive oil (or vegan butter) and leek and cook, stirring occasionally, until somewhat browned and caramelized - about 3-5 minutes. Add the garlic and sauté for 1 minute until fragrant.",
      "4. Reduce heat to medium and add sage, arborio rice, and salt and cook for 1 minute, stirring to coat. Add dry white wine and cook for 1-2 minutes, stirring frequently, or until the liquid is absorbed.",
      "5. Using a ladle or measuring cup, add warmed miso pumpkin broth 1/2 cup (120 ml) at a time, stirring almost constantly, giving the risotto little breaks to come back to a simmer. The heat should be medium, and there should always be a slight simmer. You want the mixture to be cooking but not boiling, or it will get gummy and cook too fast.",
      "6. Continue to add miso broth, stirring to incorporate, until the rice is al dente - cooked through but still has a slight bite. This whole process should only take 15-20 minutes (time based on original batch size // adjust if altering to make more or less).",
      "7. Taste and adjust flavor as needed, adding more salt to taste or maple syrup (optional) to enhance the pumpkin flavor.",
      "8. CRISPY SAGE (optional): Heat oil in a small skillet or saucepan over medium heat. Add sage and a healthy pinch of salt and sauté for a few minutes to brown the sage slightly (this allows the flavor to deepen). Be careful not to let it burn.",
      "9. To serve, divide risotto between serving bowls and garnish with crispy sage (optional).",
      "10. Best when fresh, though leftovers will keep covered in the refrigerator for 2-3 days. Reheat in the microwave or on the stovetop over medium heat, adding vegetable broth or water as needed to rehydrate. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/09/Pumpkin-Risotto-SQUARE.jpg",
    "description": "Risotto infused with pumpkin and topped with crispy sage.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Vegan White Bean Soup",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "20 mins",
    "cookTime": "25 mins",
    "nutrition": "290 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 Tbsp olive oil ((if oil-free, sub twice the amount of water))",
      "1 small white, yellow, or sweet onion, diced ((1 small onion yields ~1 1/2 cups or 200 g))",
      "4 cloves garlic, minced ((4 cloves garlic yield ~2 Tbsp or 18 g))",
      "2 medium carrots, peeled and diced ((2 carrots yield ~3/4 cup or 100 g))",
      "2 stalks celery, diced ((2 stalks yield ~1 cup or 100 g))",
      "1 ¾ - 2 tsp sea salt",
      "1/4 tsp black pepper",
      "1 tsp dried thyme ((or 1 Tbsp fresh thyme))",
      "2 medium potatoes, cut into 1/2-inch pieces ((we used Yukon gold // 2 potatoes yield ~3/4 lb or 380 g))",
      "2 (15-oz.)  cans white beans, drained and rinsed",
      "5 cups water",
      "2-3 cups finely chopped kale ((optional))",
      "1 (13.5-oz.) can light coconut milk",
      "1-2 Tbsp lemon juice",
      "Fresh parsley",
      "Whole grain (or gluten-free bread)"
    ],
    "recipeInstructions": [
      "1. In a large pot or Dutch oven, heat the oil over medium-low heat. Once hot, add the onion and cook until translucent - about 2 minutes. Add the garlic, carrots, celery, salt, and pepper and cook until softened and fragrant, stirring occasionally - about 4-5 minutes.",
      "2. Add the thyme and stir for one minute. Then add the potatoes, beans, and water and bring to a boil. Reduce the heat to low, cover, and simmer for 15-20 minutes or until the potatoes are fork-tender and the flavors have melded.",
      "3. Stir in the kale (optional), then cover and simmer until tender – about 5 minutes. Finally, add the coconut milk and lemon juice and heat through – about 2 minutes. Taste and adjust, adding more salt for balance or more lemon juice for brightness. Optionally, garnish with fresh parsley and serve warm with toasted bread of choice.",
      "4. This soup is even better on the second day! Leftovers keep for 3-4 days in the refrigerator or in the freezer for up to 1 month."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/10/Creamy-White-Bean-Soup-SQUARE.jpg",
    "description": "Wholesome, comforting, creamy white bean soup with potatoes and thyme.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Vegan 'Fish' and Chips",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "20 mins",
    "cookTime": "20 mins",
    "nutrition": "88 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 large celeriac, peeled and cut into 1-inch strips ((1 large celeriac is ~1 lb or 450 g))",
      "Water ((for boiling))",
      "1 Tbsp sea salt ((for salting water))",
      "1 cup DIY Gluten-Free Flour Blend",
      "1 tsp sea salt",
      "3 Tbsp nori seaweed flakes, or nori sheets blitzed in a blender  ((for sea flavor // optional))",
      "2/3 - 3/4 cup plain unsweetened sparkling water ((for a lighter texture // or sub regular water))",
      "1/4 cup avocado oil ((or other neutral, high-heat oil // for frying))",
      "Perfect Roasted Potatoes",
      "Baked Garlic Matchstick Fries",
      "Crispy Cajun Baked Fries (Oil-Free!)",
      "Easy Vegan Tartar Sauce ((or store-bought))",
      "Lemon wedges ((optional))"
    ],
    "recipeInstructions": [
      "1. &quot;FISH&quot;: Add 3 quarts (~3 liters) of water and 1 Tbsp salt to a large pot and bring to a boil. Once boiling, carefully add celeriac strips and cover. Boil celeriac for 8-9 minutes, or until fork tender. Carefully remove and place on a cooling rack or a plate to dry and cool slightly.",
      "2. CHIPS: If you want to enjoy your fish with 'chips' (fries), start preparing your choice of Perfect Roasted Potatoes, Baked Garlic Matchstick Fries, or Crispy Cajun Baked Fries (Oil-Free!) while your celeriac boils.",
      "3. BATTER: In a medium mixing bowl, combine gluten-free flour, salt, and nori flakes (optional for 'sea' flavor) and whisk to combine. Add sparkling water (starting with the lesser amount) and whisk until smooth and no lumps remain. Let the batter rest for 5 minutes to thicken slightly. After resting, it should be similar to pancake batter in texture (see photo) - add more water to thin or flour to thicken.",
      "4. In a large rimmed skillet (we prefer cast iron), large pot, or Dutch oven, heat the avocado oil over medium-high heat. Using your fingers or a fork, dunk each boiled celeriac strip into the batter - you want them thickly and evenly coated. Carefully transfer the battered strips to the hot avocado oil. Each piece should sizzle nicely when you place it in the oil - if it doesn't make any sound, turn up the heat slightly. Continue dunking and adding the strips to the skillet until the skillet is full. Once sizzling, cook each strip for ~3-4 minutes on the first side.",
      "5. Then use tongs or a metal spatula to carefully lift and flip the strips - they should come up easily. If they are sticking badly they likely haven't cooked long enough. Cook for 2-3 minutes on the second side, or until lightly browned. Transfer the fried pieces to a cooling rack or a plate with a napkin to drain excess oil, then dunk and fry any remaining celeriac strips that didn't fit in the skillet. Set aside until cool enough to handle.",
      "6. Meanwhile, prepare a batch of Easy Vegan Tartar Sauce (or use store-bought), remove your chips/fries from the oven, and enjoy the fish and fries dunked in tartar sauce!",
      "7. Best when fresh. We tested freezing and reheating the &quot;fish&quot; and it crisps back up nicely, but the celeriac flavor is stronger and the crispy coating pulls away from the celeriac a bit. Reheat from frozen by baking on a greased baking sheet at 400 F (204 C) for 10-15 minutes, flipping at the halfway point."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/11/Vegan-Fish-and-Chips-SQUARE.jpg",
    "description": "Crispy, flaky, vegan 'fish' and chips, made with celeriac.",
    "serve": 15,
    "review": []
  },
  {
    "recipeName": "Creamy Vegan Potato Leek Soup",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "15 mins",
    "cookTime": "30 mins",
    "nutrition": "149 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 cups sliced leeks, halved lengthwise, cut into 1/4 inch slices ((1 medium leek yields ~2 cups or 180 g))",
      "1 Tbsp olive oil ((or vegan butter // if oil-free, sub with twice as much water))",
      "1/2 cup finely chopped celery*",
      "1 tsp sea salt",
      "1/2 tsp black pepper",
      "3/4 tsp dried thyme ((or 2 tsp fresh))",
      "4 large cloves garlic, minced",
      "4 cups chopped potatoes, washed thoroughly, cut into 1/2-inch cubes ((we prefer unpeeled Yukon gold // 1 1/2 lbs yield ~4 cups))",
      "2 1/2 cups water ((or sub up to half with vegetable broth and use less salt))",
      "1 cup canned light coconut milk ((or sub homemade cashew cream*))",
      "Sliced green onion or chives",
      "Coconut bacon",
      "Vegan sour cream"
    ],
    "recipeInstructions": [
      "1. Remove the end and dark green part of the leek and discard (or reserve greens for making vegetable broth). Slice the white and light green part of the leek in half lengthwise and clean by running cold water over each half, getting in between the leaves to remove any dirt. Then slice into 1/4-inch slices.",
      "2. Heat a large pot or Dutch oven over medium heat and add the olive oil, chopped leek, and celery. Cook for about 5 minutes, until everything is slightly softened and fragrant. Add salt, pepper, thyme, and garlic. Cook for another 1-2 minutes, stirring frequently.",
      "3. Add in the potatoes, toss to evenly combine leek mixture with the potatoes, and sauté for 3-4 minutes, stirring frequently.",
      "4. Add in the water and coconut milk and bring the soup to a boil. Once boiling, reduce to a low simmer and cover for 20-25 minutes, stirring every 10 minutes or so. After 25 minutes your potatoes should be fork tender but still somewhat intact.",
      "5. Once your potatoes are cooked, use an immersion blender to purée 3/4 of the soup, leaving some small chunks of potato. You can also put half of the soup in a high-speed heat-proof blender, blend until smooth, and add it back to the rest of the soup. We like our soup a little rustic and brothy with pieces of potato, but you can also purée it until completely smooth if preferred.",
      "6. Taste and adjust as needed, adding salt for overall flavor, black pepper for kick, or more thyme for complexity.",
      "7. Serve in bowls (optionally) garnished with sliced green onions or chives, coconut bacon, and vegan sour cream. Store leftovers in a sealed container in the refrigerator for 3-4 days or in the freezer for 1 month. Reheat on the stovetop over low-medium heat until warm."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/09/Potato-Leek-Soup-SQUARE.jpg",
    "description": "Easy to make. Made in 1 pot with just 9 ingredients.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Easy Penne Arrabbiata",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "5 mins",
    "cookTime": "30 mins",
    "nutrition": "399 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "Water for boiling",
      "1 Tbsp salt ((for seasoning the water))",
      "10-12 ounces pasta of choice ((penne is best // gluten-free as needed))",
      "2 Tbsp olive oil, plus more for finishing ((if oil-free, sub water and add more as needed as it evaporates))",
      "4 cloves garlic, minced",
      "2-3 tsp crushed red pepper flakes*, plus more for serving",
      "3 Tbsp tomato paste*  ((organic, high quality when possible))",
      "1 (28-ounce) can crushed tomatoes ((we prefer Pomi or San Marzano))",
      "3 healthy pinches sea salt, plus more to taste",
      "2-3 tsp maple syrup, plus more to taste",
      "1/4 cup vegan parmesan cheese",
      "Fresh basil, chopped or torn"
    ],
    "recipeInstructions": [
      "1. Bring a large pot of well-salted water to a boil for the pasta.",
      "2. Heat a large rimmed skillet or saucepan over medium heat. Once hot, add olive oil,  minced garlic, and crushed red pepper flake (for milder spice, start with the lesser quantity - for a serious kick, go with the full amount!). Cook for 1 minute, stirring constantly, and watching carefully not to let it burn.",
      "3. Add tomato paste and stir into the garlic and red pepper flake (a spoon or rubber spatula works best). Cook until fragrant and the tomato paste has darkened slightly - ~2-3 minutes.",
      "4. Add crushed tomatoes, salt, and maple syrup and stir. Bring to a very low simmer. Cook, covered, for 20-30 minutes, or until the sauce has reduced slightly and the flavors are deepened.",
      "5. Taste and adjust flavor as needed, adding more salt to taste, red pepper flake for heat, or maple syrup for sweetness / to balance the spice. A bit more tomato paste can be added for depth of flavor, but a little goes a long way. And if the flavors aren't quite developed, simmer for just a bit longer (covered) to allow the flavors to deepen.",
      "6. Meanwhile, when the water in the pot boils, add the pasta and stir to prevent clumps. Cook to al dente according to the package instructions. Reserve 1/2 cup of pasta water then drain the pasta.",
      "7. Add the cooked pasta to the sauce and stir to coat. If your sauce looks too thick, add pasta water 2 tablespoons at a time until you have a silky sauce that clings to the noodles. You likely won't need all of the reserved pasta water.",
      "8. Serve as is or garnished with vegan parmesan cheese and fresh basil. Extra red pepper flakes on top add additional heat and a pop of color.",
      "9. Store leftovers covered in the refrigerator up to 2-3 days, though best when fresh. Sauce is freezer friendly (when stored separate from the pasta) for up to 2 months. Reheat pasta on the stovetop, adding a bit of water to thin as needed."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/05/Penne-Arrabiatta-SQUARE.jpg",
    "description": "Perfect arrabbiata sauce that's spicy and garlicky with vibrant tomato flavor.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "The BEST Vegan Burger (GF, Soy-Free)",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "25 mins",
    "cookTime": "35 mins",
    "nutrition": "410 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 cup cooked and cooled brown rice  ((measured after cooking))",
      "4 Tbsp avocado oil, divided",
      "1 1/2 cups thinly sliced yellow onion ((~1 small onion as recipe is written))",
      "5 cups sliced shiitake mushrooms ( (or sub cremini, but you will need more oat flour))",
      "3/4 cup raw cashews",
      "1/2 - 1 cup oat flour ((ground from rolled oats - certified GF as needed))",
      "1/2 tsp each sea salt and black pepper",
      "2 tsp miso paste ((we like chickpea miso by Miso Master, or yellow or white soy miso))",
      "1 Tbsp coconut aminos ((or sub tamari))",
      "1/4 tsp smoked paprika",
      "Hamburger buns",
      "Ketchup",
      "Vegan mayo",
      "Tomato",
      "Lettuce",
      "Pickles",
      "Mustard",
      "Caramelized Onions"
    ],
    "recipeInstructions": [
      "1. If your brown rice isn't cooked yet, start there by following this method or using an Instant Pot for the best results. Otherwise, move on to the next step.",
      "2. Start by caramelizing the onions. Place 1 tablespoon (15 ml) of avocado oil and the sliced yellow onion in a large heavy-bottomed skillet (like a large cast iron pan or Dutch oven) and turn it to medium-low heat. Stir constantly and sauté until the onions begin to turn translucent, then turn the heat down to low. Add 2 tablespoons of water and cover, removing the lid every few minutes and stirring to prevent burning. Cook the onions for at least 25 minutes, until they've taken on some color and have reduced by about half (see photo).",
      "3. Add another 1 tablespoon (15 ml) of avocado oil to the onions along with the sliced mushrooms. Spread the mushrooms out so they are in as thin a layer as possible and turn the heat up to medium-low. Sauté for about 5 minutes, stirring regularly, until the mushrooms are fragrant and soft. Turn the heat off and set aside.",
      "4. Place the cashews in a food processor and pulse until cashews are a small, even crumb texture - about 10 pulses. Place the cashew crumbs in a bowl and set aside.",
      "5. Add the cooled rice to the now-empty food processor and pulse until slightly crumbled, about 5 pulses. Add the cooked mushrooms and onions and pulse until well combined with no obvious or large pieces of mushrooms remaining - about another 5 pulses.",
      "6. Add the oat flour (starting with the lesser amount), salt and pepper, miso paste, coconut aminos, and smoked paprika, and pulse a few times to combine. Add the cashew crumble and pulse once or twice to distribute the cashews without overmixing. The mixture should be thick and sticky, but easy to form into patties. If too wet, add more oat flour and stir by hand. Taste and adjust, as needed, adding more salt to taste.",
      "7. Using a 1/2-cup measuring cup, scoop your burger mixture and form into 4 even patties. Heat the remaining 2 tablespoons (30 ml) avocado oil in your heavy-bottomed skillet over medium heat, and place the patties in the oil. Cover and let cook for about 3 minutes, uncover and flip, then cover and cook for an additional 3 minutes. Continue cooking if the patties aren't as crispy as you'd like.",
      "8. Enjoy! Serve on buns with homemade ketchup, vegan mayo, tomatoes, lettuce, and your other favorite burger toppings! Vegan burger patties can be saved before or after cooking, and will keep in the refrigerator for up to 5 days or the freezer for up to 1 month. Reheat cooked burgers on the stovetop over medium heat until warmed through and fragrant."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/04/Best-Vegan-Burger-SQUARE.jpg",
    "description": "The ultimate vegan burger that's magically bean-free.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Easy Vegan Picadillo",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "10 mins",
    "cookTime": "20 mins",
    "nutrition": "297 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 Tbsp olive oil ((if oil-free, sub twice as much water))",
      "2 cups diced white or yellow onion ((1 medium onion yields ~2 cups or 320 g))",
      "1/2 medium red bell pepper, finely chopped",
      "1 1/2 cups roughly chopped shiitake mushrooms ((3 ounces yield ~ 1 1/2 cups // or sub cremini mushrooms))",
      "1 1/2 Tbsp minced garlic ((~4 cloves))",
      "1 Tbsp coconut aminos ((for depth of flavor))",
      "2 (15-oz.) cans brown lentils, rinsed and drained ((2 cans yield ~2 1/2 cups cooked lentils))",
      "1 tsp dried oregano",
      "1/2 tsp ground cumin",
      "1 pinch ground cayenne ((optional // for heat))",
      "1/4 tsp each sea salt and black pepper ((plus more to taste))",
      "1 (8-oz.) can tomato sauce ((or sub tomato passata))",
      "3/4 cup water",
      "1/2 cup roughly chopped pimento-stuffed green olives ((or other green olives in brine))",
      "1/4 cup roughly chopped raisins ((optional // or sub dried currants or sultanas))",
      "Freshly chopped cilantro",
      "Roasted plantains",
      "White (or brown rice)"
    ],
    "recipeInstructions": [
      "1. Heat a large-rimmed skillet, pot, or Dutch oven over medium heat. Once hot, add oil, onion, and bell pepper and sauté, stirring frequently, for 3-4 minutes.",
      "2. Add the mushrooms, stir, and sauté for 2 minutes. Then add garlic and coconut aminos and sauté for 4-5 minutes, stirring occasionally, until the mushrooms are golden brown. Turn down heat if browning too quickly.",
      "3. Then add drained lentils, oregano, cumin, cayenne (optional), salt and pepper, tomato sauce, water, olives, and raisins (optional). Stir to combine and simmer (covered) for 10-15 minutes, stirring occasionally, to develop flavors.",
      "4. Remove the lid and cook for 1-2 minutes, stirring frequently, to thicken. Taste and adjust flavors as needed, adding more cumin for smokiness, olives for saltiness/tanginess, raisins for sweetness, or cayenne for heat.",
      "5. We love serving this with roasted plantains, rice (white or brown), and cilantro. Enjoy!",
      "6. Leftovers keep well stored in the refrigerator for 3-4 days or in the freezer for up to 1 month. Reheat on the stovetop or in the microwave until warmed throughout."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/11/Easy-Vegan-Picadillo-SQUARE.jpg",
    "description": "A delicious, easy, plant-based twist on Cuban-inspired picadillo.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Plantains 101: Perfectly Roasted Every Time!",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "5 mins",
    "cookTime": "15 mins",
    "nutrition": "247 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "2 ripe plantains ((yellow with brown spots // see post above for tips on choosing plantains!))",
      "1 Tbsp melted coconut oil  ((or avocado oil))",
      "1 healthy pinch sea salt  ((optional))",
      "Magic Green Sauce"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 425 F (218 C) and line a large baking sheet with parchment paper.",
      "2. To cut the plantains, trim and discard the ends. Then use the tip of your knife to make a shallow cut lengthwise through the peel, doing your best not to pierce the flesh of the plantain. Remove the peel and slice the plantain on an angle into 1/4-inch slices.",
      "3. Place the sliced plantains on the prepared baking sheet and toss with oil and salt (optional).",
      "4. Bake for 10 minutes, then flip and bake for another 5-10 minutes or until golden brown and slightly caramelized on both sides.",
      "5. They're delicious paired with our Easy Vegan Picadillo, Smoky Instant Pot Black Eyed Peas &amp; Greens, Black Bean Plantain Vegan Bowls, Jamaican Jerk Grilled Eggplant (30 Minutes!), or either of the sauces recommended above.",
      "6. Best when fresh. Store leftover plantains in a sealed container in the refrigerator for 1-2 days and reheat on the stovetop or in the oven until warmed through. Not freezer friendly."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/10/How-to-Roast-Plantains-SQUARE.jpg",
    "description": "A step-by-step guide for sweet, perfectly roasted plantains.",
    "serve": 2,
    "review": []
  },
  {
    "recipeName": "Ginger Sesame Vegan Meatballs",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "30 mins",
    "cookTime": "40 mins",
    "nutrition": "63 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 Tbsp toasted sesame oil",
      "8 oz. roughly chopped cremini mushrooms ((~4 cups chopped))",
      "1 (15-oz.) can black beans",
      "4 cloves garlic, minced",
      "3 stalks green onion, thinly sliced",
      "2 1/2 Tbsp minced fresh ginger",
      "1 1/2 - 2 Tbsp tamari ((or low-sodium soy sauce if not gluten-free // if soy-free, sub coconut aminos))",
      "1 Tbsp maple syrup ((or honey if not vegan // if using coconut aminos instead of tamari, use half the maple syrup))",
      "1 cup cooked and cooled quinoa ((plus more if needed))",
      "Steamed broccoli or cauliflower",
      "Teriyaki sauce",
      "Sesame seeds",
      "Grain of choice"
    ],
    "recipeInstructions": [
      "1. If you haven't done so, cook quinoa and set aside to cool. To prepare 1 cup cooked quinoa: Add 1/3 heaping cup (65 g) dry quinoa to a small saucepan and toast for 2-3 minutes over medium heat. Then add 2/3 cup (160 ml) water and bring to a boil. Once boiling, cover and reduce heat to a simmer. Cook for 10-15 minutes or until water is absorbed. Then fluff with a fork, remove from the heat, and crack the lid so the quinoa can cool.",
      "2. Heat a large skillet over medium heat with the sesame oil. Once hot, add the mushrooms and sauté for 10-15 minutes, stirring occasionally, until they are lightly browned and have released most of their moisture.",
      "3. Drain and rinse the black beans, then dry in a clean kitchen towel.",
      "4. To the sautéed mushrooms, add the black beans, garlic, green onion, ginger, and tamari (or soy sauce or coconut aminos). Sauté for 3-4 minutes, or until slightly softened, stirring frequently. Set aside to cool slightly.",
      "5. Preheat the oven to 400 F (200 C) and set out a baking sheet.",
      "6. Transfer the mixture to a food processor and pulse until no large pieces of beans or mushrooms remain, being careful not to overmix into a paste.",
      "7. Add 1 cup (185 g) cooked and cooled quinoa (adjust amount if altering batch size) and the maple syrup (or agave or honey). Pulse to combine until a textured dough forms, again being careful not to overmix.",
      "8. Taste and adjust flavor as needed, adding more tamari for saltiness/depth of flavor, sesame oil for nuttiness, or maple syrup for balance. If it's too wet, add more quinoa and pulse to combine.",
      "9. Scoop out 1 1/2-Tbsp portions of dough and gently shape into round balls using wet hands. Recipe as written makes ~15 meatballs. Add formed meatballs to a bare or parchment-lined baking sheet.",
      "10. Bake for 15 minutes. Then flip to ensure even baking and bake for another 10-15 minutes, or until golden brown and slightly dry to the touch.",
      "11. These &quot;meatballs&quot; are delicious served with steamed or roasted broccoli, sesame seeds, teriyaki sauce, and your grain of choice (brown rice, white rice, quinoa, coconut rice, millet // or cauliflower rice for grain-free).",
      "12. Leftovers will keep up to 3-4 days in the refrigerator or 1 month in the freezer. To reheat cooked meatballs from frozen, place on a baking sheet and bake at 400 F (200 C) for 10-12 minutes."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/11/Ginger-Sesame-Vegan-Meatballs-SQUARE.jpg",
    "description": "Vegan and gluten-free Ginger Sesame Meatballs that are crispy and tender.",
    "serve": 15,
    "review": []
  },
  {
    "recipeName": "Easy Salmon Green Curry (1 Pot!)",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "20 mins",
    "cookTime": "25 mins",
    "nutrition": "371 kcal",
    "vegan": false,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 Tbsp coconut or avocado oil",
      "2 small shallots, thinly sliced ((2 shallots yield ~3/4 cup or 85 g // or sub equivalent amount of diced onion))",
      "3 cloves garlic, minced ((3 cloves yield ~1 1/2 Tbsp))",
      "1-2 Tbsp minced fresh ginger",
      "1/2 - 1 small serrano pepper, finely chopped  ((depending on the heat of your curry paste // optional))",
      "2 1/2 cups chopped sweet potato, cut into 1/2-inch cubes ((scrubbed clean // 1 medium sweet potato yields ~2 1/2 cups or 230 g))",
      "2 1/2 cups bite-sized cauliflower florets ((or sub broccoli florets, sliced cabbage, or green beans cut into 1-inch pieces))",
      "1 cup red bell pepper, cut into 1/2-inch pieces ((1 small pepper yields ~1 cup or 125 g))",
      "1/2 - 3/4 cup DIY green curry paste",
      "1 1/2 cups water",
      "1 (14-oz.) can full-fat coconut milk",
      "1-2 Tbsp coconut aminos ((or sub half as much tamari))",
      "2-3 tsp maple syrup, honey, or palm sugar ((optional))",
      "1/4 tsp sea salt ((omit if using store-bought curry paste))",
      "1-2 Tbsp lemon or lime juice ((optional))",
      "1 pound salmon filets, skin and bones removed, cut into 1-inch cubes",
      "2 cups chopped kale, collard greens, or baby spinach  ((optional))",
      "Freshly chopped cilantro or basil ((Thai basil if available))",
      "Chopped roasted cashews",
      "Rice"
    ],
    "recipeInstructions": [
      "1. Heat the oil in a large pot over medium heat. Once hot, add the shallots, garlic, ginger, and serrano (optional) and sauté for 2-3 minutes, until softened.",
      "2. Add the sweet potato, cauliflower (or other veggie of choice), and red bell pepper and cook for 3-4 minutes, stirring frequently to soften slightly.",
      "3. Add the green curry paste (starting with the lesser amount and using only 2-3 Tbsp if subbing store-bought), water, coconut milk, coconut aminos, maple syrup or honey (optional), and salt (omit if using store-bought curry paste) and stir. Taste the broth - it should be subtly spicy and a little rich, sweet, salty, and bright. Adjust if needed, adding more curry paste for curry flavor, ginger for freshness and zing, coconut aminos for saltiness, serrano for heat, maple syrup for sweetness, or lemon or lime juice for brightness (you'll likely need the lemon/lime if using store-bought curry paste but not if using homemade).",
      "4. Cover and simmer until the vegetables are fork tender - about 5-10 minutes. Then stir in the cubed salmon and chopped kale (or collard greens or spinach // optional), reduce heat to medium-low, and simmer gently until just cooked through - about 5 minutes. Taste and adjust once more, adding lemon or lime juice for brightness, maple syrup for sweetness, coconut aminos for depth, or salt to taste.",
      "5. Serve warm garnished with freshly chopped basil or cilantro and/or chopped roasted cashews (all optional). It pairs well with rice (brown or white), coconut rice, cauliflower rice, or quinoa.",
      "6. Leftovers will keep stored in the refrigerator for 1-2 days or in the freezer for up to 1 month. Reheat gently on the stovetop until warmed through."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/11/Salmon-Green-Curry-SQUARE.jpg",
    "description": "A versatile, Thai-inspired green curry made with salmon and lots of fresh veggies.",
    "serve": 6,
    "review": []
  },
  {
    "recipeName": "Creamy Vegan Cauliflower Gratin (GF)",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "15 mins",
    "cookTime": "45 mins",
    "nutrition": "234 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": true,
    "recipeIngredients": [
      "1 medium head cauliflower, cut into small florets ((~7-8 cups florets))",
      "1 1/2 Tbsp olive oil ((or sub vegan butter // if oil-free, sub water and add more as needed))",
      "1 cup finely chopped onion ((~1/2 small onion))",
      "4 cloves garlic, minced",
      "2 Tbsp cornstarch or arrowroot starch",
      "1 (14-oz.) can light coconut milk",
      "1/8 tsp ground nutmeg",
      "1 Tbsp nutritional yeast  ((optional))",
      "1/2 tsp sea salt ((plus more to taste))",
      "1/4 tsp black pepper",
      "1/3 cup vegan parmesan cheese",
      "Fresh thyme leaves"
    ],
    "recipeInstructions": [
      "1. Preheat the oven to 375 degrees F (190 C).",
      "2. Cut cauliflower into small, even florets and steam in a large pot with a steamer basket (covered) until tender when pierced with a fork - about 15 minutes. Remove from heat and set aside uncovered to cool slightly.",
      "3. Meanwhile, heat a large oven-safe skillet (we like cast iron) over medium heat. Add the olive oil (or vegan butter) and onion and sauté until the onion becomes tender and translucent - about 3-5 minutes. Add the garlic and cook for 1 minute or until fragrant, being careful not to let it burn.",
      "4. Reduce the heat to low. Add the cornstarch or arrowroot and whisk to incorporate. Cook for 1 minute.",
      "5. Pour in the coconut milk a little at a time, whisking constantly to incorporate. Go slowly to prevent clumps from forming. Continue until all of the milk has been added. Simmer for 8-10 minutes or until thickened, whisking frequently.",
      "6. Add the nutmeg, nutritional yeast (optional), salt, and pepper. Taste and adjust seasonings as needed, adding more nutmeg for warmth, nutritional yeast for cheesiness, or salt or pepper to taste. Mixture should be very cheesy and savory to season the cauliflower well.",
      "7. Add the steamed cauliflower to the sauce and toss thoroughly to coat. Taste once more and add more salt if needed. (Note: If you didn't use an oven-safe skillet, you can transfer the mixture to an 8 x 8-inch baking dish now.)",
      "8. Sprinkle the top with vegan parmesan cheese and bake uncovered for 12-15 minutes, until the top is golden brown and crisp. If using a cast iron pan, you can broil on high for the last 1-2 minutes (watching closely) for a crispier top. Remove from the oven and let stand for 5-10 minutes before serving. Garnish with thyme leaves (optional) and serve hot.",
      "9. Best when fresh. Leftovers will keep stored in the refrigerator for 3-4 days. Not freezer friendly. Reheat leftovers in a 350 F (176 C) oven until warmed through."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/09/Vegan-Cauliflower-Gratin-SQUARE.jpg",
    "description": "Perfectly tender cauliflower tossed in a salty, rich, cheesy sauce.",
    "serve": 4,
    "review": []
  },
  {
    "recipeName": "Butternut Squash Lasagna",
    "author": "Minimalist Baker",
    "type": "Dinner",
    "prepTime": "30 mins",
    "cookTime": "60 mins",
    "nutrition": "436 kcal",
    "vegan": true,
    "vegeterian": false,
    "glutenFree": false,
    "recipeIngredients": [
      "1 small butternut squash ((1 small squash yields ~2 cups or 480 g purée))",
      "10-12 cloves garlic, peeled and left whole",
      "1 1/4 cup raw cashews",
      "3 Tbsp lemon juice",
      "1/2 tsp sea salt",
      "1 Tbsp nutritional yeast ((optional))",
      "1 1/2 cups water ((plus more as needed to blend))",
      "10 ounces dry lasagna noodles",
      "1 Tbsp salt ((for salting pasta water))",
      "1/2 tsp olive oil",
      "1 1/2 Tbsp olive oil",
      "1 large onion, diced ((1 onion yields ~3 cups chopped))",
      "6 cups roughly chopped cremini mushrooms",
      "8 cups finely chopped kale ((1 bundle yields ~8 cups))",
      "1/2 tsp each sea salt and black pepper",
      "1 tsp dried thyme  ((optional))",
      "Freshly chopped basil",
      "Vegan parmesan cheese"
    ],
    "recipeInstructions": [
      "1. Preheat oven to 425 F (218 C) and line a baking sheet with parchment paper. Slice your squash in half lengthwise and remove the seeds, but leave the skin on. Rub squash flesh with a bit of oil. Place garlic cloves on the prepared baking sheet and top with squash cut side down (the scooped-out squash should cover the garlic so it doesn't burn). Bake for 30-40 minutes, or until the skin is blistered and golden brown and a knife inserted into the squash comes out very easily.",
      "2. While the squash is cooking, bring a large pot of salted water to a boil. Cook the lasagna noodles in the salted water according to package instructions or until al dente. Then drain, set aside, and gently toss with a little olive oil to prevent the noodles from sticking together.",
      "3. Heat a large rimmed skillet over medium heat. Once hot, add the olive oil and onion and sauté for 3-4 minutes or until softened, then add the mushrooms and sauté another 5-7 minutes or until lightly browned. Then add kale, salt, pepper, and thyme (optional) and sauté for another 5-7 minutes or until tender.",
      "4. Once the squash is tender and cool enough to handle, scoop 2 cups (~480 g) roasted squash (adjust amount if altering number of servings) into a high-speed blender. Add roasted garlic cloves, cashews, lemon juice, salt, nutritional yeast (optional), and water and blend until smooth, adding more water and scraping down the sides of the blender as needed. It should be thick, creamy, and scoopable. Taste and adjust as needed, adding more salt for overall flavor, lemon for brightness, garlic for savory flavor, or nutritional yeast for cheesiness.",
      "5. Reduce oven temperature to 350 F (177 C).",
      "6. Assemble the lasagna in a 9 x 13 (or similar size) glass or ceramic baking dish. Add 1/2 cup (120 ml) sauce to the bottom of the pan and spread it evenly. Then add a layer of noodles followed by 1/3 of the filling. Repeat with two more layers of sauce, noodles, and filling. Then finish with a layer of noodles and the remaining sauce as the top layer (it should be a thicker layer fully coating the noodles).",
      "7. Bake lasagna at 350 F (177 C) for 30 minutes or until the top layer is slightly dry and a little darker in color.",
      "8. Carefully remove from the oven and let cool 5-10 minutes before serving. Then slice, serve, and enjoy. We recommend garnishing with freshly chopped basil and vegan parmesan cheese. See notes below for freezing instructions."
    ],
    "image": "https://minimalistbaker.com/wp-content/uploads/2021/08/Butternut-Squash-Lasagna-SQUARE.jpg",
    "description": "Butternut squash sauce meets pasta, kale, and mushrooms.",
    "serve": 6,
    "review": []
  }
]
